[["After Trump made it clear that Obama had illegally tapped the phones at Trump Tower, the FBI issued a warrant for his arrest. Since then, little has been heard from the former president other than a denial. This morning, Obama was stopped at a checkpoint at Toronto International Airport, where he was trying to fly to an unknown destination under the alias “Bruce Wilekenmeyer.” The CRMP officer who stopped him recognized him beneath a fake mustache, took him into custody and turned him over to the US Embassy. After a short transport back to Washington, Obama was brought before a special session of US District Court where he could be formally charged and ordered not to leave the country before being released into his attorney’s custody. A court reporter who also moonlights for Breitbart took great personal risk to snap this photo since there are no photographs, video recording or any other recording devices allowed in federal courtrooms unless specifically ordered by a judge:", "As you can see, he had also died the gray in his hair to help mask his appearance. It didn’t work. Share this and make sure everyone knows that the traitor was caught and will answer for his crimes!!!", "comments", ["usaconservativereport.com/2017/08/breaking-leaked-picture-obama-dragged-judge-handcuffs-wiretapping-trump/", "BREAKING: Leaked Picture Of Obama Being Dragged Before A Judge In Handcuffs For Wiretapping Trump"]], ["Social media", "Change post", "Remove post", "Change comment", "Remove comment", "Change comment", "Remove comment", "Change comment", "Remove comment", "Change comment", "Remove comment", "Change comment", "Remove comment", "Change comment", "Remove comment", ["gloria.tv/video/yRrtUtTCfPga6cq2VDJPcgQe4", "Putin says: ‘Pope Francis Is Not A Man Of God’ | Must-See !!"]], ["The crown prince arrived in New York before Trump was sworn into office", "The Obama administration felt misled by the United Arab Emirates", "Former national security adviser Susan Rice privately told House investigators that she unmasked the identities of senior Trump officials to understand why the crown prince of the United Arab Emirates was in New York late last year, multiple sources told CNN.", "The New York meeting preceded a separate effort by the UAE to facilitate a back-channel communication between Russia and the incoming Trump White House.", "The crown prince, Sheikh Mohammed bin Zayed al-Nahyan, arrived in New York last December in the transition period before Trump was sworn into office for a meeting with several top Trump officials, including Michael Flynn, the president’s son-in-law, Jared Kushner, and his top strategist Steve Bannon, sources said.", "Related article", "Russia proposed full normalization with US under Trump, Kremlin says", "The Obama administration felt misled by the United Arab Emirates, which had failed to mention that Zayed was coming to the United States even though it’s customary for foreign dignitaries to notify the US government about their travels, according to several sources familiar with the matter. Rice, who served as then-President Obama’s national security adviser in his second term, told the House Intelligence Committee last week that she requested the names of the Americans mentioned in the classified report be revealed internally, a practice officials in both parties say is common.", "Rice’s previously undisclosed revelation in a classified setting shines new light on a practice that had come under sharp criticism from the committee chairman, California Rep. Devin Nunes, and President Donald Trump, who previously accused Rice of committing a crime.", "But her explanation appears to have satisfied some influential Republicans on the committee, undercutting both Nunes and Trump and raising new questions about whether any Trump associates tried to arrange back-channel discussions with the Russians.", "“I didn’t hear anything to believe that she did anything illegal,” Florida Rep. Tom Rooney, a Republican helping to lead the panel’s Russia invesigation, told CNN of Rice’s testimony. He declined to discuss any of the contents of her classified remarks.", "Related article", "Exclusive: Justice Department declines Senate request to interview FBI officials over Comey firing", "Through a spokeswoman, Rice declined to comment about her testimony. Nunes refused to answer questions when asked about Rice Tuesday evening.", "It’s unclear precisely which Trump officials Rice discussed at the House meeting. But multiple sources have confirmed to CNN that Zayed met at the time with Flynn, Kushner and Bannon. The three-hour discussion focused on a range of issues, including Iran, Yemen and the Mideast peace process, according to two sources who insisted that opening up a back-channel with Russia was not a topic of discussion.", "Still, the fact that the New York meeting occurred prior to the Seychelles session and that the UAE did not notify the Obama administration about why the crown prince was coming to the United States has raised questions in the eyes of investigators on Capitol Hill.", "But the Trump Tower meeting came shortly before the UAE brokered a meeting to open lines of communications with the United States and Russia, with a clandestine January meeting in the Seychelles Islands in the Indian Ocean, according to reports in CNN and The Washington Post. That meeting is now under investigation on Capitol Hill, though it’s unclear whether Rice mentioned the Seychelles meeting in the testimony.", "A senior Middle East official told CNN that the UAE did not “mislead” the Obama administration about the crown prince’s visit, but acknowledged not telling the US government about it in advance. The meeting, which took place December 15, 2016, the official said, was simply an effort to build a relationship with senior members of the Trump team who would be working in the administration to share assessments of the region.", "Related article", "Dems to Mueller: Flynn failed to disclose trip to broker Saudi-Russian business deal", "“The meeting was about ascertaining the Trump team’s view of the region and sharing the UAE’s view of the region and what the US role should be,” the official said. “No one was coming in to sell anything or arrange anything.”", "A spokesperson for the crown prince declined to comment.", "The Seychelles meeting – and the circumstances around it – has been a subject of interest to Hill investigators looking at any potential link between the Trump campaign and Russia.", "The Washington Post initially reported in April that the UAE brokered a pre-inauguration meeting between the founder of the security firm Blackwater, Erik Prince, who is a close Trump ally, and an associate of Vladimir Putin’s in the Seychelles Islands. The purpose of the meeting was part of an effort by the UAE to persuade Russia to curtail its relationship with Iran, including in Syria, according to the Post.", "Related article", "Read Dems' letter to Mueller: Flynn failed to disclose trip to broker Saudi-Russian business deal", "And it occured shortly after Bannon, Flynn and Kushner also met in Trump Tower with Zayed, whom the Post said helped arrange the Seychelles meeting with Russia government officials to set up the private discussions with the Trump team.", "But the senior Middle East official told CNN this week that Prince’s name was not discussed at the Trump Tower meeting. And Prince himself has said he did nothing wrong, telling CNN’s Erin Burnett last month: “I was there for business.”", "Both the White House and Prince have strongly denied that Prince was working as a liaison for the Trump administration.", "Prince said he met with a Russian while at the Seychelles but “I don’t remember his name.”", "“It probably lasted about, as long as one beer,” he said about the meeting.", "For her part, Rice had been called to the House Intelligence Committee to testify partly over what Nunes and other Republicans believed was an abuse in the practice of “unmasking” – or revealing the identities of Americans who were communicating with foreign officials under surveillance by the US intelligence community. Simply unmasking the names of individuals in classified reports does not mean that their identities will be revealed publicly, and Rice denied to the committee that she leaked classified information to the press, sources familiar with the matter said.", "But Rice’s suggestion that she unmasked the names of US individuals – who turned out to be Trump associates – over concerns about the propriety of the crown prince’s visit to the United States could help her fend off attacks that she was out of line in the actions she took.", "Rep. Trey Gowdy, a South Carolina Republican who is helping lead the House investigation, told the Daily Caller “nothing that came up in her interview that led me to conclude” that she improperly unmasked the names of Trump associates or leaked it to the press.", "Related article", "Flynn refusing new request to speak to Hill committee", "Sarah Sanders, the White House press secretary, did not say explicitly whether Trump still believes Rice committed a crime but added the issue of leaking and unmasking needs to be investigated.", "“We’ve seen illegal leaking of classified materials, including the identities of American citizens unmasked in intelligence reports,” Sanders told CNN. “That’s why the President called for Congress to investigate this matter and why the Department of Justice and Intelligence Community are doing all they can to stamp out this dangerous trend that undermines our national security.”", "Nunes was forced to step aside from running the Russia investigation amid a House ethics inquiry into whether he improperly disclosed classified data. The ethics inquiry came in the aftermath of his bombshell comments that Obama administration officials had improperly unmasked the names of Trump associates, a revelation that Trump used as cover for his unsubstantiated claim that Obama had Trump Tower wiretapped during the election to spy on him. The Justice Department said in a court filing Friday that the DOJ and the FBI have no evidence to support Trump’s claims.", "But on Tuesday, the Republican who took over the investigation from Nunes said there was no reason to bring Rice in for further questioning.", "“She was a good witness, answered all our questions,” Rep. Mike Conaway, the Texas Republican now running the House Russia probe, told CNN. “I’m not aware of any reason to bring her back.”", "CNN’s Elise Labott and Dana Bash contributed to this report. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.", ["www.cnn.com/2017/09/13/politics/susan-rice-house-investigators-unmasked-trump-officials/index.html", "Rice told investigators why she unmasked Trump aides"]], ["LEGENDARY astronaut Buzz Aldrin passed a lie detector test over claims he's encountered alien life, reports claim. Aldrin, the second man on the moon, and four others gave accounts of their sightings under strict lab conditions. He, Al Worden, Edgar Mitchell and Gordon Cooper all took part in the study conducted by the Institute of BioAcoustic Biology in Albany, Ohio. Aldrin, 88, claimed he was a spaceship on his way to the moon, adding: \"There was something out there that was close enough to be observed... sort of L-shaped.\" The tests, reportedly more reliable than standard lie detector tests, showed he was telling the truth, the Daily Star reported. Apollo 15 pilot Worden, 85, and Apollo 14's Mitchel also claimed to have seen UFOs while Cooper says he actually tried to chase a cluster of objects. Tests analysing their voice patterns suggested they were also telling the truth about their strange encounters. Aldrin answered questions about his alleged encounter with alien life on a Reddit Q&A with fans last week. In one post he said: \"On Apollo 11 in route to the Moon, I observed a light out the window that appeared to be moving alongside us. \"There were many explanations of what that could be, other than another spacecraft from another country or another world. \"It was either the rocket we had separated from or the four panels that moved away when we extracted the lander from the rocket. \"It was not an alien. Extraordinary observations require extraordinary evidence. That's what Carl Sagan said. \"There may be aliens in our Milky Way galaxy, and there are billions of other galaxies. The probability is almost certain that there is life somewhere in space. \"It was not that remarkable, that special, that unusual, that life here on earth evolved gradually, slowly, to where we are today.\" On July 21, 1969, Neil Armstrong made history by becoming the first person to set foot on the earth’s moon. Upon landing, he is famously quoted as saying: \"That's one small step for man, one giant leap for mankind.\" Buzz was on the same mission, Apollo 11, as Neil Armstrong and soon followed in his footsteps - making him the second man on the moon. In total, Neil and Buzz were on the lunar surface for only 21 hours, 36 minutes and 21 seconds. Pete Conrad was a moon walker on the Apollo 12 mission, which launched on November 14, 1969. He was partnered by Alan Bean. Also on the Apollo 12 mission, was Alan Bean. He and Pete were on the moon for two days - November 19 and 20, 1969. ©News Group Newspapers Limited in England No. 679215 Registered office: 1 London Bridge Street, London, SE1 9GF. \"The Sun\", \"Sun\", \"Sun Online\" are registered trademarks or trade names of News Group Newspapers Limited. This service is provided on News Group Newspapers' Limited's Standard Terms and Conditions in accordance with our Privacy & Cookie Policy. To inquire about a licence to reproduce material, visit our Syndication site. View our online Press Pack. For other inquiries, Contact Us. To see all content on The Sun, please use the Site Map. The Sun website is regulated by the Independent Press Standards Organisation (IPSO)", "Our journalists strive for accuracy but on occasion we make mistakes. For further details of our complaints policy and to make a complaint please click this link: thesun.co.uk/editorial-complaints/", ["www.thesun.co.uk/news/5999912/buzz-aldrin-ufo-lie-detector-test-alien-life-exists-convinced/", "Buzz Aldrin ‘passes UFO lie detector test leaving experts convinced that he encountered alien life’"]], ["James Fields, from Ohio, arrested following attack at ‘Unite the Right’ gathering, and two police officers die in helicopter crash", "A man has been arrested and charged with murder after a car rammed into a group of people peacefully protesting against a white supremacist rally in Charlottesville, Virginia, killing one person and injuring 19. Police said a 32-year-old woman had died and that they were attempting to notify her family before releasing more details. Col Martin Kumer, the superintendent of Albemarle-Charlottesville regional jail, told the Guardian that 20-year-old James Fields, of Ohio, had been arrested following the attack on Saturday. “He has been charged with second degree murder, three counts of malicious wounding and failing to stop at an accident that resulted in a death,” Kumer said in an email. Donald Trump condemned the “violence on many sides”, but faced criticism for failing to directly denounce the far-right demonstrators. In a separate incident, two police officers died when their helicopter, which was monitoring the far-right rally, crashed outside Charlottesville. State police said in a statement the helicopter was “assisting public safety resources with the ongoing situation” when it crashed in a wooded area. The pilot, Lieutenant H Jay Cullen, 48, of Midlothian, Virginia, and Trooper-pilot Berke Bates of Quinton, Virginia, died at the scene. The deaths came at the end of a day marked by violent clashes between far-right nationalists and people who had come to protest against their occupation of a downtown park containing a statue of the Confederate general Robert E Lee. Witnesses said those hit by the car were peacefully protesting against the white supremacist rally and footage showed the vehicle crashing into another car, throwing people over the top of it. The photographer Pat Jarrett, who witnessed the incident, said: “A gray Dodge Charger plowed into a sedan and then into a minivan. Bodies flew. People were terrified and screaming. Those closest to it said it was definitely a violent attack. The driver, who people later described as a skinny white guy with a straggly beard, reversed out of there and drove off, the front end of his car all smashed up.”", "Charlottesville mayor Mike Signer tweeted: “I am heartbroken that a life has been lost here. I urge all people of good will – go home.”", "Speaking at a press conference on Saturday evening, the governor of Virginia, Terry McAuliffe, who had earlier declared a state of emergency, told the white supremacists: “Go home … Shame on you. You pretend you are patriots, but you are anything but a patriot.”", "The mother of Fields told the Associated Press on Saturday night that she knew her son was attending a rally in Virginia but didn’t know it was a white supremacist rally. “I thought it had something to do with Trump. Trump’s not a white supremacist,” Samantha Bloom said, before becoming visibly upset as she learned of the injuries and deaths at the rally “He had an African-American friend …,” she said before her voice trailed off. Responding to the events in Charlottesville from Bedminster, New Jersey, Trump: “We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence on many sides, on many sides.”", "But the Republican senator Marco Rubio tweeted that it was important for Trump to describe the events as a “terror attack by white supremacists”. The FBI said it was opening a civil rights investigation into the accident along with the justice department’s civil rights division and the district attorney’s office. The US attorney general, Jeff Sessions, said: “The violence and deaths in Charlottesville strike at the heart of American law and justice. When such actions arise from racial bigotry and hatred, they betray our core values and cannot be tolerated. WATCH: White nationalists and counter-protesters clash at Charlottesville rally https://t.co/4qH1yJjrGy", "The car attack came about two hours after state police in riot gear had cleared Emancipation Park, the site of the Robert E Lee statue. The city’s decision in February to remove the statue drew earlier protests by the “alt-right” and the Ku Klux Klan. Riot police cleared the park after almost an hour of clashes. The far-right groups were largely compliant, but had to run the gauntlet of counter-protesters as they walked west along Market Street.After a brief stalemate, a hard core of about 100 far-right protesters moved to a park two miles away and gathered to hear speakers who had been scheduled for the “Unite the Right” event. One of the speakers, the far-right figurehead Richard Spencer, said he had been maced on the way in and lashed out at police and city authorities. “Never in my life have I felt like the government was cracking down on me until today,” said Spencer. “We came in peace and we were effectively thrown to the wolves.”", "He said that they would not back down from protesting against the statue. When he mentioned Mayor Signer by name, the crowd chanted: “Jew! Jew! Jew!”", "Around the park, members of the far right were nursing and treating minor wounds. One of them, who declined to give his name, was bleeding from the head, and claimed to have been struck with an iron bar. Another young man, with a swastika tattoo on his chest and blood on his forehead, told photographers: “If you take my picture, I’ll cut you. I’m not even kidding.”", "Meanwhile, counter-protesters were trying to stop the far-right groups from entering the park. Some counter-protesters, including many marching under red and black anti-fascist banners, tried to block the streets. This led to altercations with far-right groups, who were seen using chemical weapons, sticks and shields on people. A group of clergy linked arms to block a set of stairs leading into the park. The Rev Seth Wispelwey, of Sojourners United Church of Christ in Charlottesville, said: “We’re here to counteract white supremacy, and to let people know that it is a system of evil and a system of sin.”", "Steve Thomas, from Lynchburg, Virginia, who also protested against the far-right groups, said: “I think that what we are witnessing here has always been simmering beneath the surface, and now has been emboldened and enabled by the Trump administration’s politics and rhetoric.”", "In February, the city council narrowly voted to remove and sell the Robert Lee statue, and to rename the park in which it stands from Lee Park to Emancipation Park. This was the culmination of a campaign to remove the statue started by a local high school student, Zyahna Bryant. It was part of a wave of such removals of Confederate monuments across the south, which began after Dylann Roof massacred nine African American churchgoers in Charleston, South Carolina. In response, last May, Richard Spencer led a torchlit white nationalist parade around the park. Then, on 8 July, about 50 members of the Loyal White Knights of the Ku Klux Klan held a rally in the park, and were greeted by about 1,000 counter-protesters. The day ended in turmoil after police used tear gas on some counter-protesters following the Klan’s departure, and made 23 arrests. Ben Jacobs and the Associated Press contributed to this report", ["www.theguardian.com/us-news/2017/aug/12/virginia-unite-the-right-rally-protest-violence", "Man charged with murder after driving into anti-far-right protesters in Charlottesville"]], ["Donald Trump will soon issue an executive order to ban Facebook in the country. _Y_ear 2017 does not seem to be going well for the United States of America. Sources have said that US President Donald Trump will soon issue an executive order to ban Facebook in the country. _O_n the other hand, even some Republican leaders said that they were opposed to the idea of Facebook — an American corporation — being banned in the country. _U_nfazed by the criticism from his own party members, Trump said that this move would fight fake news being circulated on social media websites. “Inside, we both know what’s been going on. We know the game and we’re gonna play it,” said Trump. _G_overnance involves taking difficult steps, said the US president, adding that despite", "Facebook taking action against fake news", ", a lot of false stories and ‘alternative facts’ were still being circulated on the site. _O_ther social websites like Twitter and Instagram, though, will be excluded from the executive order. _T_he people working for Facebook are not happy about this selective exclusion. _R_ick Rowlinson, a source from Facebook, said that even if the ban on Facebook was actually meant to fight against fake news, the President’s “commitment” should have not just been limited to Facebook. “You know the rules and so do I. A full commitment’s what I’m thinking of,” Rowlinson said. “You wouldn’t get this from any other guy,” he added, shaking his head. _I_n California, where Facebook is based, a large section of people have already begun protesting against this move. _C_ourts in the US had earlier blocked Trump’s travel ban executive order. _K_een on supporting the President,", "Vice President Mike Pence has also said", "that he will support the executive order if it is passed by Trump. _R_eacting to this proposed order, Facebook co-founder and CEO Mark Zuckerberg said that Facebook will continue to run its operations from California even if the site is banned in the US. _O_n Trump’s claim to fight fake news, Zuckerberg said that an outright ban was not the correct way to fight false news. _L_ast month, reports were saying that a court in Pakistan was mulling", "action against Facebook", "over ‘blasphemous content’. _L_ately, there have been some countries speaking out against social media websites. If Trump’s executive order is passed, US will join the list of those countries. _E_mployees of Facebook are planning to start a signature campaign against the order if it gets passed. _D_onald Trump’s remarks on Facebook and Zuckerberg’s response has gone viral. Click here to view the full statements", ". With inputs from", "FP Special Forces", "Find us on YouTube", "is on YouTube", "Copyright @ 2024. Firstpost - All Rights Reserved", ["www.firstpost.com/world/donald-trump-to-issue-an-executive-order-to-ban-facebook-across-us-3363348.html", "Donald Trump to issue an executive order to ban Facebook across US"]], [["obama.trendolizer.com/2017/12/breaking-sasha-obama-just-crashed-her-expensive-new-car-into-a-lake.html", "BREAKING: Sasha Obama Just Crashed Her Expensive New Car Into A Lake"]], ["During his presidential election campaign, Trump repeatedly vowed to Make Christmas Merry Again. But the reality has proved different to all his Yuletide rhetoric", "U.S. President Donald Trump has long positioned himself as a front-line soldier in the so-called War on Christmas, which made non-Christians justifiably nervous as they anticipated his administration’s first holiday season as a religiously charged, exclusionary and divisive affair.", ["www.haaretz.com/us-news/how-donald-trump-lost-the-war-on-christmas-1.5629520", "How Donald Trump Lost the 'War on Christmas'"]], ["New to Pirate 4x4?", ["www.pirate4x4.com/forum/general-chit-chat/2543657-dea-just-raided-united-states-senator.html", "DEA Just Raided A United States Senator"]], ["A version of this action that uses less javascript and may be usable for those who don't use javascript is available at https://actionnetwork.org/petitions/urgent-new-law-would-charge-protesters-with-terrorism?nowrapper=true&referrer=&source=&oneclick=", ["actionnetwork.org/petitions/urgent-new-law-would-charge-protesters-with-terrorism/", "URGENT: proposed law would charge protesters with terrorism"]], ["Filed under:", "The leaks that plagued the DNC, John Podesta, and others are crucial to the Russian interference probe. Update: On Friday, Special Counsel Robert Mueller indicted 12 Russian intelligence officials who he alleges are involved in these hackings and leaks. You can read about the new breaking indictment at this link. Our original explainer on the hackings, written before the new indictment, is below. Original post: There’s one positively enormous shoe that still hasn’t dropped in special counsel Robert Mueller’s investigation into Russian interference with the 2016 campaign: an indictment about all those hacked emails. The hacking and release of leading political figures’ emails is the most visible election intervention attributed to Russia’s government. And it’s long been one of the leading, and perhaps the leading, possibility about just what “collusion” between Donald Trump’s team and the Russians might have involved. That’s not mere speculation. We’ve gradually learned of not one but six times Trump associates at least tried to get involved with either Russian-provided dirt, hacked Democratic emails, or WikiLeaks. We don’t yet know whether these furtive contacts resulted in anything of significance — but one of these advisers, George Papadopoulos, has already pleaded guilty to lying to the FBI about the matter and has begun cooperating with Mueller’s team. These hacks were crimes, victimizing many hundreds of Americans (those who had their documents stolen, and those who corresponded with them). The operation was more wide-ranging than many remember, targeting not just John Podesta and the DNC but many other people and groups. It wasn’t just emails stolen, either — posted material ranged from Democratic Party turnout data that a Republican operative thought was “probably worth millions of dollars” to even a purported picture of Michelle Obama’s passport. No charges have been filed in the matter — yet. But some are likely coming. The Wall Street Journal has reported that the US has identified “more than six members of the Russian government” involved in the DNC hacks. And the Daily Beast wrote that investigators have identified a specific Russian intelligence officer behind “Guccifer 2.0,” a leading figure in the hacks. Mueller is now overseeing the probe. To understand what happened in 2016, we have to understand the hackings. And though some mysteries remain, much of the complex story has gradually been pieced together by journalists and cybersecurity experts. The consequences, of course, unfolded in plain sight during the campaign itself. The media often shorthands the 2016 hack story as: Russians hacked Podesta and the DNC’s email accounts, and WikiLeaks then posted those hacked emails publicly. The full story is more complex. Let’s start at the beginning. Between March 2015 and May 2016, a group of hackers went on a phishing expedition. The “baited lines” they cast out were at least 19,000 malicious emails that resembled the one below:", "These emails were designed to look as if they were coming from Google. But they were in fact designed to trick people into clicking through and entering their login credentials — delivering them right into the hackers’ hands. According to a later Associated Press analysis of a report by the information security firm SecureWorks, at least 573 of the more than 4,700 email addresses targeted were American. They included many US government officials, military officials, intelligence officials, and defense contractors. Particularly beginning in March and April 2016, these targets began to include many Democrats as well. Per the AP, more than 130 Democratic accounts were sent these malicious links, compared to just “a handful” of Republican accounts. Podesta and several Clinton staffers — along with former Secretary of State Colin Powell, retired Gen. Philip Breedlove, and others — had their accounts successfully compromised. (We know all this because the hackers used the link-shortening tool Bitly to do their work and accidentally left their activity publicly viewable.)", "Russia was eventually blamed for the phishing expedition, for several reasons. For one, SecureWorks concluded the particular malware used in this campaign was tied to a hacking group that outside researchers had been tracking for some time — a group they thought to be linked the GRU, Russia’s foreign military intelligence agency. We don’t know what the secretive hacking group calls itself, but various cybersecurity researchers had given it several names: Iron Twilight, APT (Advanced Persistent Threat) 28, Pawn Storm, and — most famously — “Fancy Bear.”", "Circumstantial evidence also suggests a Russian-tied culprit. For instance, the phishers were extremely focused on Ukraine — at least 545 targeted email accounts were from there, comparable to the number of American targets. These included Ukraine’s president and many other top government officials, who are hostile to Vladimir Putin’s regime. The Russians targeted, meanwhile, were generally critics of Putin’s government and journalists. Another interesting detail, per the AP, is that more than 95 percent of the malicious links were created between the hours of 9 am and 6 pm, Monday to Friday — Moscow time. Around April 2016, as this phishing campaign increasingly began to target Democrats, material was also taken from the DNC. The firm Crowdstrike attributed this as a hack from Fancy Bear, citing the malware used, and other firms agreed with this assessment. These firms also concluded that a separate group of Russian-tied hackers (dubbed “Cozy Bear”) had been in the DNC’s systems for much longer, since all the way back in the summer of 2015. The precise mechanisms of how the DNC was breached remain somewhat murky. But Fancy Bear’s phishing campaign did send out malicious links to nine DNC email accounts in March and April 2016. And as we’ll soon see, hacked DNC material ended up in the same place as hacked material from Podesta and others. A January 2017 US intelligence report would later specifically blame Russia’s GRU — the agency thought to be behind Fancy Bear — for taking “large volumes of data from the DNC.”", "As striking as all this may seem, though, government-backed hacking is far from unusual. The US does it. Our allies do it. Our rivals do it. China was said to have hacked Barack Obama and John McCain’s presidential campaigns in 2008 and was then tied to a massive theft of federal data in 2015. Foreign intelligence agencies trying to peek into political activities seemed to be something that just, well, happened all the time. What came next in 2016, however, was a jarring departure from these norms — the hacked information began to be posted publicly, in massive amounts. The backdrop to all of this was the US presidential election — the first series of primaries and caucuses took place in February and early March. The surprisingly Russia-friendly Donald Trump emerged as the clear leader in the Republican contest, over his Putin-critical rivals Ted Cruz and Marco Rubio. Meanwhile, Hillary Clinton, with whom Putin’s regime had long had chilly relations, emerged as the favorite for the Democratic nomination over Bernie Sanders. It was around this point — in mid-March 2016 — that the phishing campaign began to particularly target many Democrats’ and Clinton campaign staffers’ email accounts, according to SecureWorks’ analysis. There were several other events that, in retrospect, are either relevant or at the very least intriguing:", "Throughout all this time, there was no public indication that the phishing campaign, or the hacking of the DNC and other campaign figures’ emails, had taken place. Just days later, that would change. On June 12, 2016, WikiLeaks founder Julian Assange dropped a bombshell. “We have upcoming leaks in relation to Hillary Clinton,” he announced, during a British television interview. “We have emails pending publication.”", "WikiLeaks — a nonprofit launched back in 2006 by Assange, an Australian activist — had previously been most famous for posting a plethora of internal US military documents about the Iraq and Afghanistan wars (including video of a deadly airstrike) and more than 250,000 diplomatic cables from the US State Department — leaked by Chelsea Manning. Assange was then accused of rape and sexual assault in Sweden, and he sought political asylum from Ecuador. He has been holed up in the nation’s London embassy since June 2012. Assange’s announcement was the first public indication that Democrats would soon be plagued by leaked internal emails. So two days after that, the DNC, which had learned of the hacking of its systems and hired Crowdstrike to respond, decided to get in front of what it feared was coming. The committee told the Washington Post that it had been hacked — by, it claimed, the Russian government. Crowdstrike’s CEO put up a blog post explaining why he identified Russia as the culprit. Yet the next day, June 15, things got even weirder — because that is when “Guccifer 2.0” arrived on the scene. (The name, a portmanteau of “Gucci” and “Lucifer,” is an homage to the original Guccifer, the jailed Romanian hacker Marcel Leher Lazar, who’d broken into high-profile Americans’ email accounts.)", "In a Wordpress post, the new Guccifer said that Crowdstrike was quite wrong about the DNC hack, which he said was carried out by him, “a lone hacker.” (“Fuck CrowdStrike!!!” he wrote.) He said that he’d given “the main part of the papers, thousands of files and mails” that he’d stolen, to WikiLeaks. (WikiLeaks has refused to confirm that he was its source.) He also began to post several documents he claimed were from the DNC server. Almost immediately, journalists pointed to inconsistencies in Guccifer’s story and linguistic tics to suggest he was Russian — or more than one Russian. (US intelligence agencies would eventually say Russia’s GRU was behind the persona, and the Daily Beast recently reported that the account’s user once slipped up and neglected to mask his identity through a VPN — allowing investigators to match a particular Russian intelligence officer to that Guccifer 2.0 login.)", "Yet what Guccifer had access to was clearly broader than just the DNC. None of the first documents he posted showed up in WikiLeaks’ DNC email dump, and in fact, many of them eventually showed up in John Podesta’s emails, which were released much later. Additionally, on June 27, Guccifer emailed the Smoking Gun’s William Bastone a link to a password-protected post on DCLeaks.com that contained phished emails and documents from Clinton staffer Sarah Hamilton. (DCLeaks had not yet publicly posted any material related to the election.)", "On July 6, Guccifer 2.0 posted his first documents that would eventually be found in the DNC emails. The New Yorker’s Raffi Khatchadourian speculates, based on some comments Guccifer made to journalists at the time, that Guccifer or his handlers were frustrated that WikiLeaks was taking too long to actually post the DNC material and were threatening to spoil Assange’s exclusive. (A week later, Guccifer would send documents to the Hill’s Joe Uchill, writing that he was doing so because the press was “gradually forget[ing] about me,” and complained that WikiLeaks was “playing for time.”)", "All the while, Assange and WikiLeaks were working to prepare their database of DNC emails, with the apparent goal of publishing them before the Democratic convention began in late July. It’s unclear how they set that goal. Assange would later tell Khatchadourian that he originally had a deadline of July 18 to release them, but “we were given a little more time.” (It’s unclear, though, who gave him more time, and Assange later disputed the accuracy of the recorded quote.)", "Finally, on July 22 — the Friday before the convention — WikiLeaks posted those thousands of DNC emails and attachments online. They revealed that many DNC members privately spoke of Bernie Sanders with disdain, drove DNC Chair Debbie Wasserman Schultz and other top staffers to resign, and overall made an ugly start for the Democratic convention. Though Assange remained mum on his source, Guccifer 2.0 jubilantly claimed credit in a tweet:", "@wikileaks published #DNCHack docs I'd given them!!! #HillaryClinton #DonaldTrump #BernieSanders #Guccifer2 https://t.co/TXFAySUKWw", "The DNC leaks proved to be just the beginning. News soon broke that the Democratic Congressional Campaign Committee (DCCC) had also been hacked, and on August 12, DCCC documents started showing up on Guccifer’s Wordpress site. Guccifer also sent the DCCC’s internal turnout model data to Florida Republican Party operative Aaron Nevins, who was positively thrilled to receive it. “Holy fuck man I don’t think you realize what you gave me,” Nevins wrote in a DM. “This is probably worth millions of dollars.” Nevins soon put it online on his anonymously run blog. Then DCLeaks got in the game. On August 12, the site posted a few emails from some little-known Republican state party aides, and from campaign advisers to Sens. John McCain (R-AZ) and Lindsey Graham (R-SC), both of whom were known as Russia hawks. In September, the site’s anonymous administrators sent Colin Powell’s phished emails to reporters, revealing his candid assessments of both Clinton (“greedy”) and Trump (“national disgrace”). DCLeaks then posted phished emails from Ian Mellul, an Obama White House staffer who had volunteered for Clinton. The Mellul documents included a picture of Michelle Obama’s passport and a months-old audio file in which Hillary Clinton said Sanders’s young supporters were “living in their parents’ basement.” Longtime Clinton ally Capricia Marshall’s phished emails came next. Many of these disclosures caused brief stirs, but what everyone was really waiting for was the next WikiLeaks dump. Roger Stone, the Trump associate, claimed that he knew Assange had something huge on the way and speculated it would involve the Clinton Foundation. Assange himself told Fox News back on August 24 that his team had “thousands of pages of material” and was “working around the clock” to prepare it for publication. By early October, there was still nothing from WikiLeaks, but Stone continued to hype an imminent release, saying “an intermediary” who’d met with Assange said “the mother lode is coming Wednesday.”", "The “mother lode” instead came two days later, on Friday, October 7, when WikiLeaks posted its first batch of Podesta’s emails. The site would continue to post them, in batches, up through the election. Earlier on that very same day, the US government officially attributed the hacking effort to the Russian government, and the Donald Trump Access Hollywood tape hit the news. In the end, the 2016 election was close, decided by just over 1 percentage point in three Electoral College states. And whether or not the email leaks were sufficient to swing the outcome, they certainly were effective at keeping the words “Hillary Clinton” and “emails” in the headlines throughout the campaign’s final stretch. During the campaign, it was clear enough that Trump was unusually friendly to Russia, and that the Russian government interventions seemed aimed at trying to help his electoral chances at the expense of Hillary Clinton. But after the election, more and more attention became devoted to whether Trump associates and Putin’s government coordinated to intervene in the campaign in some way. And on March 20, 2017, then-FBI Director James Comey publicly confirmed the FBI was investigating just that topic. No one has produced a smoking gun demonstrating clear involvement just yet. But this isn’t mere idle speculation, either — there are at least six instances in which Trump associates tried to get Russian dirt or communicated with hacking and leaking figures. The first of them was what initiated the FBI investigation into the Trump campaign and Russia to begin with:", "#business pic.twitter.com/NvlHAeUKdV", "1) The Papadopoulos tip: Fancy Bear’s phishing campaign targeted Clinton staffers and Democrats in large numbers in March and April 2016, but the hacks remained publicly unknown for months afterward. Yet it was very early indeed — on April 26 — that Trump foreign policy adviser George Papadopoulos got his tip about what was coming. As described above, the tip was from a source Papadopoulos understood to have Russian government connections, professor Joseph Mifsud. Mifsud specifically said he’d gained his information from traveling to Moscow and meeting high-level officials there. And he said Russia had “dirt” on Hillary Clinton — and, specifically, thousands of emails. We don’t yet know whether he told others in the Trump campaign about what he’d heard. But it seems highly likely that he did. He was a young adviser eager to impress campaign higher-ups. And we already know he drunkenly bragged about his inside info to an Australian diplomat a few weeks later. (The Australians later told the FBI, which led the bureau to open the investigation.)", "In any case, Papadopoulos was arrested last summer for making false statements to FBI investigators, cut a plea deal, and began cooperating with investigators. So whatever he did do with his tip, Mueller likely now knows it. 2) The Trump Tower meeting: It was on June 3, 2016 — a little more than a month after Papadopoulos’s tip, but still before any news broke about Democrats having been hacked — that publicist Rob Goldstone emailed an acquaintance of his, Donald Trump Jr. Goldstone described some news from his clients Aras and Emin Agalarov, a father-son pair of real estate developers who’d done business with the Trumps:", "The Crown prosecutor of Russia met with his father Aras this morning and in their meeting offered to provide the Trump campaign with some official documents and information that would incriminate Hillary and her dealings with Russia and would be very useful to your father. This is obviously very high level and sensitive information but is part of Russia and its government’s support for Mr. Trump - helped along by Aras and Emin. Don Jr. enthusiastically accepted the offer, and Goldstone arranged a meeting six days later, on June 9. The Trump delegation included Don Jr., Paul Manafort, and Jared Kushner. They met Goldstone, Russian lawyer Natalia Veselnitskaya, Agalarov company executive Ike Kaveladze, Russian-American lobbyist Rinat Akhmetshin, and translator Anatoli Samochornov. Once the existence of the meeting became public, all parties involved claimed it was a dud, resulting in nothing of consequence. But the timing of the meeting is strange. Three days later, Assange announced he’d received emails related to Hillary Clinton. Two days after that, the DNC announced it had been hacked and blamed Russia. Goldstone saw an article about that and emailed it to Emin and Kaveladze, writing that the news was “eerily weird” considering what they’d just discussed at the Trump Tower meeting. Guccifer 2.0 began posting the day after that. 3) The Cambridge Analytica CEO’s contacts with WikiLeaks: Cambridge Analytica is the Steve Bannon-tied firm that did digital work for the Trump campaign and has been in the news of late. And last year, we learned that Cambridge’s CEO, Alexander Nix, had twice contacted WikiLeaks on the topic of hacked emails. Nix says that in “early June,” after he learned of Assange’s claims to have Hillary Clinton-related emails, he reached out to Julian Assange to ask for an advance look at those emails. He says Assange turned him down. Then in August, after Assange had posted the DNC emails, Nix emailed Cambridge employees to say that he’d recently reached out to Assange again, offering help at organizing the DNC material on WikiLeaks. He said he hadn’t yet heard back. Both Nix and Assange have said these overtures didn’t go anywhere. 4) Donald Trump Jr.’s contacts with WikiLeaks: Then, separately, Donald Trump Jr. had some communications with WikiLeaks through the group’s Twitter account toward the end of the campaign. As best we know, WikiLeaks began the communication, DMing Don Jr. to tell him that they had guessed the password to a new “PAC run anti-Trump site,” PutinTrump.org, that was about to launch. “Any comments?” the group asked. Trump Jr. answered: “Off the record I don’t know who that is but I’ll ask around. Thanks.”", "Then on October 3, 2016, WikiLeaks DMed Don Jr. again, asking him to “comment on” or “push” a story that Hillary Clinton had once said she wanted to “just drone” Assange. Don Jr. answered, “Already did that earlier today. It’s amazing what she can get away with.”", "He then followed up with a question: “What’s behind this Wednesday leak I keep reading about?” This was at the height of chatter that WikiLeaks had a major batch of anti-Clinton material ready. However, there is no indication that WikiLeaks answered this question from Don Jr. or gave him any advance information that it was Podesta’s emails that were coming. The group sent him a couple more messages, but there are no more known responses from Don Jr. 5) Roger Stone’s several contacts with both Guccifer 2.0 and WikiLeaks: Roger Stone is a longtime Republican operative with a reputation for dirty tricks and a decades-long relationship with Donald Trump. Stone was only an official Trump campaign adviser briefly, departing the operation in early August 2015 after clashing with other staffers. But he remained in Trump’s orbit and, to some extent, in communication with the candidate himself afterward. Both in public and in private, Stone was fixated on the hackings and leaks. One associate of Stone’s claimed to the Washington Post that at some point in the spring of 2016, before news of the hackings broke, Stone said he’d learned from Julian Assange that WikiLeaks had obtained emails that would hurt Democrats. (Stone denies this.)", "The initial leaks from Guccifer 2.0 and WikiLeaks were posted in June and July. On August 4, Stone emailed fellow ex-Trump adviser and longtime associate Sam Nunberg:  “I dined with Julian Assange last night,” according to the Wall Street Journal. (Stone says this was a joke and flight records prove he wasn’t in London then.)", "The day after that email, on August 5, Stone penned a Breitbart article in which he took Guccifer’s story about being a lone hacker who stole the DNC emails at face value and argued Russia probably wasn’t responsible. He also tweeted that “Julian Assange is a hero.”", "Three days later, on August 8, Stone started publicly claiming to have inside information. “I actually have communicated with Assange,” he said. “I believe the next tranche of his documents pertain to the Clinton Foundation but there’s no telling what the October surprise may be.”", "A few days after that, Stone began tweeting at, and eventually DMing with, Guccifer 2.0 (who, again, has reportedly been identified as a Russian intelligence officer). Some of these DMs later leaked, leading Stone to post what he claimed was their full exchange. The posted messages are mainly friendly chitchat and not particularly substantive. On August 21, Stone tweeted an odd prediction: “Trust me, it will soon the Podesta’s time in the barrel. #CrookedHillary.” Many would later point to this — which came months before the Podesta emails became public — and ask whether Stone had advance knowledge of the Podesta email leak. (Stone himself would later claim that since this came in the midst of a scandal surrounding Stone’s old friend Paul Manafort’s Ukraine work, he was merely predicting “Podesta’s business dealings would be exposed.”)", "As October began, Stone took on a new role — as WikiLeaks’ hype man. He again claimed inside knowledge, saying a “friend” of his met with Assange and learned “the mother lode is coming Wednesday.” He tweeted: “Wednesday @HillaryClinton is done. #Wikileaks.” And when nothing came on Wednesday, Stone tweeted, “Libs thinking Assange will stand down are wishful thinking. Payload coming. #Lockthemup.” Assange published the Podesta emails two days later. Immediately, there were questions about whether the garrulous operative had been involved, which eventually spurred WikiLeaks to tweet that the group “has never communicated with Roger Stone.” The Atlantic later reported that Stone DMed the WikiLeaks Twitter account afterward, complaining that they were “attacking” him. “The false claims of association are being used by the democrats to undermine the impact of our publications,” WikiLeaks responded. “Don’t go there if you don’t want us to correct you.” Stone shot back: “Ha! The more you ‘correct’ me the more people think you’re lying. Your operation leaks like a sieve. You need to figure out who your friends are.”", "What to make of all this? Stone was obviously in contact with two of the key leakers, and his own public statements show that at one point he wanted people to think he had an inside line on WikiLeaks’ plans. However, he’s repeatedly denied any inside knowledge or involvement, and we haven’t seen any clear evidence that he truly had such knowledge. In any case, we might learn more from Mueller’s probe soon enough. “They want me to testify against Roger,” Sam Nunberg said this year, referring to the special counsel’s team. “They want me to say that Roger was going around telling people he was colluding with Julian Assange.”", "6) Peter Smith’s hunt for Hillary’s deleted emails: Last but certainly not least, there is one more email-related subplot to the 2016 campaign — and it’s a weird one. This one involves a separate set of emails: When word got out that Hillary Clinton had used a personal email account for all her work at the State Department, she agreed to hand over the work-related emails on that account to government investigators. But it turned out that she had previously deemed about 32,000 emails (about half of the total) to be “personal” rather than work-related, and deleted them. Conservatives like longtime Republican operative Peter Smith didn’t take Clinton’s explanation for why she deleted the emails at face value and questioned whether they could have contained scandalous behavior or criminal evidence. Their number included GOP presidential nominee Donald Trump. “Russia, if you’re listening, I hope you’re able to find the 30,000 [Hillary Clinton] emails that are missing,” Trump said at a July 27, 2016, press conference. “I think you will probably be rewarded mightily by our press. Let’s see if that happens. That will be next.”", "It was around this time that Smith began an unusual project. He assumed that Clinton’s email server had been hacked and that her emails must be out there somewhere, on the “dark web.” So he reached out to computer experts and conservative activists, hoping to assemble a team that would track down those emails. Smith didn’t work for the Trump campaign. But he is said to have repeatedly claimed to be in contact with Michael Flynn, who was advising Trump. One recruiting document Smith sent to cybersecurity expert Matt Tait contained the subheader “Trump Campaign (in coordination to the extent permitted as an independent expenditure).” It then listed several names: Steve Bannon, Kellyanne Conway, Sam Clovis, Flynn, and Lisa Nelson. (Bannon and Conway have denied any involvement. The other three haven’t commented.)", "Eventually, Smith gave his version of what happened to the Wall Street Journal’s Shane Harris. He said his team found five hacker groups who said they had Clinton’s emails, of which two seemed to be Russian. “We knew the people who had these were probably around the Russian government,” Smith said. However, he went on, he couldn’t determine whether the emails were authentic, so he ended up just advising the hackers to give them to WikiLeaks. No such emails have ever surfaced. Smith — 81 years old and in poor health — killed himself in May 2017, 10 days after speaking to Harris. Smith’s effort appears to have failed. But Smith admitted he had tried to get stolen documents from groups he understood to be Russian government-tied. And then there is the question of Michael Flynn’s role — particularly since, per Harris’s sources, there are intelligence reports that say Russian hackers discussed how they could get leaked emails into Flynn’s hands. Much remains murky about this situation, but Flynn is cooperating with Mueller’s team as part of a plea deal, so the special counsel likely now knows whatever he does. Last November, the Wall Street Journal’s Aruna Viswanatha and Del Quentin Wilber reported that the Justice Department had identified more than six Russian government officials involved in the DNC hack and was considering bringing charges. Interestingly, though, the report claimed that special counsel Robert Mueller had chosen not to take over the DNC hack investigation because it was “relatively technical” and had already “been under way for nearly a year.”", "That appears to have since changed. Both NBC News and the Daily Beast reported in March that Mueller had now taken charge of the email hacking investigation. And the Washington Post reported in January that Mueller had added “a veteran cyber prosecutor,” Ryan Dickey, to his team. (Credit to Marcy Wheeler for flagging this point.)", "So it’s a pretty safe bet that Mueller will bring some charges related to the email hackings. And judging by his past indictments, he’ll also use them to tell a story about what exactly happened, to the extent he can. There is, after all, a good deal we still don’t know —  for instance, how, exactly, did the DNC and Podesta emails get from the hackers to WikiLeaks?", "It’s important to remember that this is all just what we know about — there could be more that is still not public. It is certainly possible that several of their contacts with real or purported leakers and hackers listed above went nowhere, but it’s a bit harder to believe that all six of those separate contacts resulted in nothing of consequence. Mueller has already gotten three people tied to Trump to plead guilty and cooperate with the investigation. What is he getting from George Papadopoulos, who got the earliest known tip that the Russians hacked the emails? What is he getting from Michael Flynn, who may have been tied to Peter Smith’s effort to get Clinton emails from Russian hackers? What was he getting from Rick Gates, who was Paul Manafort’s right-hand man both before and during the campaign?", "All three men have pleaded guilty, and we haven’t seen any of the fruits of their cooperation yet. They may be providing Mueller information about the hacked emails, and they may not. But it’s safe to say they’re telling Mueller a good deal that’s of interest — and eventually, we will find out what. Will you help keep Vox free for all?", "At Vox, we believe that clarity is power, and that power shouldn’t only be available to those who can afford to pay. That’s why we keep our work free. Millions rely on Vox’s clear, high-quality journalism to understand the forces shaping today’s world. Support our mission and help keep Vox free for all by making a financial contribution to Vox today.", "$5/month", "$10/month", "$25/month", "$50/month", "We accept credit card, Apple Pay, and", "Google Pay. You can also contribute via", "Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again.", ["www.vox.com/policy-and-politics/2018/4/2/17164266/trump-russia-mueller-email-hackings-dnc-clinton", "The hacked emails at the center of Mueller’s Russia investigation, explained"]], ["Recently, Republican Ohio Gov. John Kasich vetoed the so-called “heartbeat bill,” a measure that would have banned all abortions after about six weeks of pregnancy, or before many women even know that they are pregnant. At the same time, Kasich signed a bill banning abortion after 20 weeks of pregnancy, with exceptions only for saving a pregnant woman’s life or preventing the “substantial and irreversible impairment of a major bodily function.”", "“At the risk of sounding discriminatory, which is not at all my goal here, but at the risk of sounding like that, there is no way women should be allowed control over whether or not they are going to have abortions,” Kasich told the Ohio Daily Star. “Women are wonderful beings, they are kind, loving, incredible and a whole other plethora of adjectives could be used to describe them, but at the end of the day, I’m sorry to have to say this, but the honest truth is that women used to be all those things. The women of today are mainly opportunists and gold diggers, who typically get pregnant due to unsafe sex, or to get their partners to marry them.”", "He continued, “Our mothers and women of the old times were the women every man deserved and was blessed to have. Today, the situation is so critical that I honestly fear for the future of this country. And so, I was in a position to make a change and do something important, and so I did. And there’s one very simple reason why I did it. That’s that, if a woman these days is not intelligent enough to keep her legs closed when they’re supposed to be closed, if she doesn’t have the foresight to make sure she doesn’t get herself in a situation where she might be pregnant, then there is no way a woman like that can or should be entrusted with the decision of having an abortion.”", "“A woman like that can barely take care of herself, and we’re supposed to tell our doctors to perform an abortion on such a woman and kill her unborn child – a being who’s done no wrong and only exists as its mother’s mistake? Do you really want to put the men and women in our healthcare in that kind of situations? To literally force them to commit manslaughter?” Kasich said. “I don’t know about the rest of the people living in my state, but I for one am not comfortable with that one bit. And so I reacted and did what was necessary to prevent that from happening.”", "“And I’ll tell you another thing – as of recently, all cases of out-of-wedlock pregnancies in the state of Ohio will have to be approved by the state. That means that every single couple that becomes pregnant and isn’t married or at the very least engaged, will be scrutinized to determine whether the pregnancy was planned or accidental. And in the case of the latter, the couple will be fined a total of $100,000, with $70,000 of the fine being charged on the mother-to-be for not being able to not only use birth control, but having sex before marriage in the first place. Women in this country really need to learn to either keep their legs closed or their other orifices open,” the governor concluded. Welcome to Newslo! Our team of dedicated authors strives to deliver the latest and most important info on finance while infusing a dose of our own style to give you a unique experience. Whether you're looking for in-depth discussions on investments or solid finance tips, we have something for everyone. Our goal is to deliver you the best possible content. So, keep reading our articles and give us your feedback!", "Input your search keywords and press Enter.", ["www.newslo.com/kasich-woman-not-intelligent-enough-keep-legs-closed-can-entrust-abortion-decision/", "Kasich: “If A Woman Is Not Intelligent Enough To Keep Her Legs Closed, How Can We Entrust The Abortion Decision To Her?”"]], ["Take our quiz and we'll tell you which products fit your lifestyle. You'll discover cleaning essentials, food storage, body care, pets, and more. Surprise me! Get one hand-picked sustainable product each month that we think you'll love.                         Create your own monthly shipment from our favorite sustainable essentials.", "The chemical Triclosan was introduced in 1972 for use as a surgical scrub in hospitals. Since then, it has increasingly been added to a wide variety of products. In a culture that has become more germ-obsessed than ever, companies have marketed products of all kinds to keep germs at bay. From airports to grocery stores to gyms and many more public spaces, there's a dispenser ready to give you a dose of anti-bacterial goo. The more we see these \"stations\", the more likely we feel the need for a bacteria-killing \"fix\". With strains like swine flu causing great panic, it seemed reasonable that people would resort to adding more and more antibacterial products to their exposed skin and cleaning routine. But why not stand behind the old tried and true method of a good 20 second hand wash at the sink? According to the American Medical Association (AMA), there is no evidence that suggests that using antibacterial soap works any more effectively than soap and water. What is Triclosan?", "Triclosan is a synthetic chemical with antimicrobial properties which destroy or inhibit the growth of microorganismssuch as bacteria or fungi. When triclosan was first introduced in the early 70's for use in hospitals, it was a good thing, as it is crucial to keep medical instruments sterile. However, over the last decade, with the rapid increase in the use of triclosan products, the chemical is becoming ubiquitous. Where is Triclosan used?This chemical is used in a wide variety of household products including soaps, toothpaste, cosmetics, deodorant, personal care products, dish detergent, first-aid, kitchenware, toys and even workout clothing! That's a long list when the original intention was just meant for the hospital room. Marketed under names like \"Microban\" that promises to keep household goods like cutting boards, garden hoses, workout clothes and computer keyboards free of bacteria and \"BioFresh\" for antimicrobial socks that keep your feet odor free. Why is Triclosan harmful?Triclosan is a known endocrine disruptor and a suspected carcinogen.There is good reason to believe that the over use of products with triclosan has contributed to bacterial resistance in the same way we are cautioned against the use of antibiotics. The persistent nature that is connected to the use of triclosan being washed down our drains daily and affecting water life. Triclosan is also lipophilic, which means it can bioaccumulate in your fat for long periods of time, and as reported byScientific American, triclosan is now detectable in human breast milk, blood, and urine samples. Environmental Health Perspectives (EHP) found the chemical in 75% of urine samples tested for a studyfocused on triclosan. And furthermore, the Center for Disease Control and Prevention detected triclosan in 58% of US waterways. According to the FDA,\"Animal studies have shown that triclosan alters hormone regulation. Other studies in bacteria have raised the possibility that triclosan contributes to making bacteria resistant to antibiotics. In light of these studies, the FDA is engaged in an ongoing scientific and regulatory review of this ingredient.\" Regarding the possible health impacts of triclosan, the F.D.A. also acknowledged, \"valid concerns about the effect of repetitive daily human exposure to these antiseptic ingredients.”", "Triclosan safety is currently under review by the F.D.A. and the E.P.A.The Environmental Protection Agency has also previously indicated that because of the amount of research being planned and currently in progress, it will undertake another comprehensive review of triclosan beginning in 2013. The use of triclosan is linked to the following effects on human health:", "How to keep clean without antibacterials:", "Monday-Friday 9am to 5pm CT", "Be in the know on deals, new products, and sustainability tips. Thank you for joining our Newsletter!", ["mightynest.com/learn/research-by-concern/dangers-of-triclosan", " If You Are Using This Toothpaste… Throw It Away Immediately Nov 28"]], ["OBSERVER ONLINE", "OBSERVER ONLINE", "The latest news and headlines!", "by", "observeronline", "·", "April 28, 2017", "It seemsas though there may be more than the normal forces at play here. Former Governor of Alaska Sarah Palin was the victim of a horrendous crime this morning while driving to meet a friend on the Pacific Coast Highway. She was run off the road in what authorities are calling a hit and run and nearly killed. The SUV she was driving rolled over several times and ended up in a drainage ditch. Governor Palin was taken to a local hospital under an alias in case the hit and run were on purpose and not a random act of reckless driving. According to her spokesman, she is currently in a coma with 2 broken vertebrae and a broken thigh. The Palin family has been notified and are currentlymaking their way to her bedside. The FBI has been dispatched to the scene to collect evidence. The vehicle that ran her off the road was caught on a traffic camera and is being hunted by every law enforcement agency in the northwest. This is a developing story that will be updated. August 22, 2017", "by", "observeronline", "· Published August 22, 2017", "January 11, 2018", "by", "observeronline", "· Published January 11, 2018", "April 27, 2017", "by", "observeronline", "· Published April 27, 2017", "More", "OBSERVER ONLINE © 2018. All Rights Reserved.", ["observeronline.news/sarah-palin-coma-hit-run/", "JUST IN: Sarah Palin In A Coma After Hit And Run"]], [["www.trendolizer.com/2016/12/breaking-florida-moves-for-full-recount-of-state-over-massive-voter-fraud-details.html", "BREAKING: Florida Moves For FULL RECOUNT Of State Over Massive Voter Fraud (DETAILS)"]], ["Bumble Bee Foods and two managers were charged by Los Angeles prosecutors Monday with violating safety regulations in the death of a worker who was cooked in an industrial oven with tons of tuna. Jose Melena was performing maintenance in a 35-foot-long oven at the company's Santa Fe Springs plant before dawn Oct. 11, 2012, when a co-worker, who mistakenly believed Melena was in the bathroom, filled the pressure cooker with 12,000 pounds of canned tuna and it was turned on. When a supervisor noticed Melena, 62, was missing, an announcement was made on the intercom and employees searched for him in the facility and parking lot, according to a report by the California Division of Occupational Safety and Health. His body was found two hours later after the pressure cooker, which reached a temperature of 270 degrees, was turned off and opened. The company, its plant Operations Director Angel Rodriguez and former safety manager Saul Florez were each charged with three counts of violating Occupational Safety & Health Administration rules that caused a death. The charges specify that the company and the two men willfully violated rules that require implementing a safety plan, rules for workers entering confined spaces, and a procedure to keep machinery or equipment turned off if someone's working on it. Rodriguez, 63, of Riverside, and Florez, 42, of Whittier, could face up to three years in prison and fines up to $250,000 if convicted of all charges, prosecutors said. Bumble Bee Foods faces a maximum fine of $1.5 million. Prosecutions of workplace violations are uncommon — even in fatalities. San Diego-based Bumble Bee said in a statement that \"we remain devastated by the loss of our colleague Jose Melena in the tragic accident.\" It said it disagreed with the charges filed by the Los Angeles District Attorney's Office and that it was \"exploring all options with respect to those charges.\"", ["www.usatoday.com/story/news/nation-now/2015/04/28/bumble-bee-foods-tuna-worker-cooked/26517161/", "Bumble Bee Foods charged after man cooked with tuna"]], [["polls.trendolizer.com/2017/12/alabama-state-police-arrest-3-poll-workers-in-birmingham.html", "Alabama State Police Arrest 3 Poll Workers In Birmingham"]], ["They say that it’s impossible to truly know what is going through someone’s mind at any given moment. We are usually fighting our own battles in hiding. We may crack up a smile when we’re truly broken inside. In fact, some of the seemingly happiest people are sometimes the ones hurting the most. If that’s not enough to want to show kindness to everyone at all times, consider that your next interaction with someone could be the line between life and death for them. Sometimes all it takes is just one word, one gesture, and one person to save a life. Brooke Lacey was only 22 years old, but her will to help others was enough to do just that. Understand your purpose and your potential so that you can take control of your emotions, your life, and your future by clickingHERE. Brooke Lacey like an increasing number of people today has struggled with mental health issues throughout her life. From anxiety to depression, it seems like as a collective, the universe has been testing us and there have been days when it was hard to simply get out of bed. Brooke understood that the way she felt was shared by many especially living in a post-pandemic world today where war is common, prices are inflated and there is no such thing as a comfortable “norm” anymore.” Yet she didn’t want to just cave into the helplessness. She wondered what she could do to restore her power, ad share that hope with everyone around her. Sign up for weekly affirmations and articles delivered directly to your inbox. All fields are required.", ["www.higherperspectives.com/powerful-note-1645303283.html", "Keanu Reeves Shook The World With Another POWERFUL Message"]], ["WARNING - DISTRESSING CONTENT: Horrifying video captured during a mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida, shows lifeless victims on the floor", "Terrified teens ran past dead bodies and screamed in horror as they fled a Florida high school where a 'crazed' gunman killed 17 people in the latest US mass shooting. Horrifying video captured by a student shows lifeless victims as teens were rescued by police and ushered out of Marjory Stoneman Douglas High School in Parkland. Students and staff barricaded themselves inside classrooms - with one group hiding in a closet as pupils cried in terror - as the shooter carried out the Valentine's Day massacre with an assault rifle despite previous warning signs. In the aftermath, one traumatised survivor described how \"there was blood everywhere\" after bullets were fired through classroom windows as the gunman stalked the sprawling campus. Teens posted disturbing photos and videos on social media, with one showing students hiding under desks and screaming as barrage of gunshots echo through the building. The suspected gunman, Nikolas Cruz, was charged on Thursday with 17 counts of premeditated murder, with the victims including an assistant football coach who gave his life to protect students. Today he appeared in court for the first time since the atrocity in Florida and will be remanded in custody. Dressed in orange overalls, he bowed his head as the charge was read out to him. A judge told him: \"I have something very important to tell you. You are charged with some very serious crimes.\"", "He was told he would be \"held without bond until further order\". His lawyer Melissa McNeill said today after the hearing: \"He's a broken human being, he's a broken child. \"The sadness this community is feeling, I mean my children go to school in this community. I feel horrible for these families. \"And Mr Cruz feels that pain.\" All 17 families have been notified of the loss of their loved ones, police said in a briefing today. The victims included students Jaime Guttenburg, Alaina Petty, 14, Martin Duque,14, Alyssa Al Hadeff, 15, Gina Montalto, 14, and Nick Dworet, 18. Luke Hoyer, Carmen Schentrup, Meadow Pollack, 18, Joaquin Oliver, 17, Cara Loughran, Peter Wang, 15, and Alex Schachter were also killed. Aaron Feis, 37, staff member Chris Hixon, 49, and science teacher Scott Beigel also were among the victims. The FBI has now launched an \"extensive review\" into how the 2017 tip into Nikolas Cruz was handled. It has also emerged that Cruz particpated in activities of white nationalist militia. In a press briefing today, Broward County Sheriff said sadly there were copycat threats made at other schools today and they would be taking all of these seriously and would respond in full. Officials in a press briefing today also revealed there were still bodies in the school. Chief Scott Israel said today: \"There are some bodies that are still in the school.\" He said that \"today is the day of mourning\" after many lives were lost in the horrific incident. On the investigation he said: \"We are not going to leave any stone unturned. \"We will interview every single student or person in that school who may know something. \"Law enforcement will do everything we can to make sure this person is convicted of all charges. We will make sure justice is served.\" Mr Israel later added: \"What about the rights of people who go to school with book bags - don't they have the right to be protected?\" He also called people in the community \"our eyes and ears\" and said \"right now, if you know anybody, this raises a red flag, don't just think about calling us, call us. \"If there's something in your gut that tells you there's something not right with this person, please say something.\" In the press briefing today, Governor Rick Scott said: \"We need to make sure this never happens again.\" He said: \"If somebody is mentally ill, they should not have access to a gun.\" Seventeen students and adults were killed and more than a dozen others were hospitalised in Wednesday afternoon's atrocity allegedly carried out by former student Cruz, described by ex-classmates as a \"troubled\" and depressed loner who was \"crazy about guns\" and had talked about shooting pupils. Students had predicted Cruz would become a school shooter due to previous threats, his obsession with guns and knives and his unusual behaviour, it was claimed. Police said the 19-year-old had previously been expelled from the school for disciplinary reasons, and returned with an AR-15 rifle - the same type of firearm used in many other massacres - plus a significant amount of ammunition and smoke bombs. The gun was legally purchased, it was claimed as the motive for the attack - the ninth-deadliest mass shooting in modern US history - remained a mystery. The atrocity began at about 2.30pm, with police claiming Cruz pulled the fire alarm and shot victims as they left classrooms before he blended in with pupils - pretending to be one of the terrified teens - and left the campus within about 25 minutes. In the video showing terrified students fleeing after shots had already been fired, pupils scream and cry in a classroom where police crouch over a body on the floor. An injured girl is carried out of the room by police and her classmates follow behind her and the officers after someone says \"let's go, come on\". There are loud screams as students - including an injured boy grimacing and clutching his shoulder - pass bodies in a corridor and they are urged to \"run\" to safety. Student Geovanni Vilsant, 15, told the Miami Herald that he heard gunfire when he was in a Spanish classroom and then saw three bodies on the floor as he fled the school. He added: “There was blood everywhere. They weren't moving.\" A female student told Fox News of the distressing things she saw as police escorted her out. She said: \"The police came through the hallway to get us and in the hallway, I saw a big pile of blood, like, kind of smeared as if they were dragged away, and I saw two girls probably dead in the hallway. \"And then, coming down the stairs, there was some more blood and outside the building there was another guy – I think it was a teacher – who was, [I’m] pretty sure was dead.\" Student Rebecca Bogart, who was in Holocaust class, told the newspaper that bullets shattered a classroom window and teens ducked for cover. Rebecca, 17, said she got onto the floor and hid under a teacher's desk. She added: “Four kids in my class were hurt. There was blood everywhere. I’m so glad to be living right now. \"I knew what gunshots sounded like, but not that loud or extreme. It smelled smoky.”", "Sarah Crescitelli hid in a theatre class bathroom and sent a text message to her parents reading: “If I don’t make it I love you and I appreciated everything you did for me.”", "Cruz allegedly wore a gas mask and tossed smoke bombs into a corridor before pulling the fire alarm and shooting people as they ran through the haze. There was confusion when the alarm went off, as students and staff had practiced a drill earlier in the day. The gunman went through corridors all over the campus, shooting more victims before leaving and blending in with pupils as they fled, it was claimed. The local school superintendent said it's believed Cruz took an Uber car to the campus. Cruz was allegedly carrying the gun in a duffel bag and had brought extra clothing with him, it was reported. Student Matthew Walker, 17, told ABC 17 that the suspect was known to show off guns and knives. The student said: \"He was going class to class just shooting at random kids. Everything he posts (on social media) is about weapons. It's sick.\" Another student, Eddie Bonilla, told CBS Miami that other students \"knew it was going to be him\" The student said: \"A lot of people were saying it was going to be him. \"A lot of kids threw jokes around saying that he was going to be the one to shoot up the school. \"It turns out that everyone predicted it. That's crazy.\" The rampage began shortly before lessons were due to end for the day at the school in Broward County, about 45 miles north of Miami. Tales of heroism began to emerge in the hours that followed. School football coach and security guard Aaron Feis, 37, was fatally injured when he threw himself in front of pupils to shield them from the killer's bullets. The football team confirmed his death on Thursday, writing on Twitter: \"It is with Great sadness that our Football Family has learned about the death of Aaron Feis. \"He was our Assistant Football Coach and security guard. He selflessly shielded students from the shooter when he was shot. \"He died a hero and he will forever be in our hearts and memories.\" Language arts teacher Melissa Falkowski hid 19 of her students in a classroom closet as the gunman went through the school. She climbed in after them and they hid from the suspect until it was safe to come out. In the aftermath, Ms Falkowski hit out at the US government and society for failing to prevent the massacre. She told CNN: \"This is the worst nightmare that could ever happen to you.\" She added: \"We’ve trained the kids what to do, and the frustration is that we did everything that we were supposed to do... and still have to have so many casualties.\" Profiles of the victims, including Mr Feis, were also starting to emerge on Thursday, as students from nearby schools returned to lessons under increased security. Student Jaime Guttenberg, 17, was confirmed dead after her parents, Fred and Jennifer, were unable to contact her amid the chaos and launched a desperate bid to find her. Mr Guttenberg posted on Facebok saying his son Jesse had escaped unharmed but added: \"We cannot reach Jaime. \"If anyone has a child who saw or spoke to Jaime please call me.\" The parents were later given the heartbreaking news that their daughter was among the dead. Her cousin Marc Pollack posted a tribute on Facebook, writing: \"This is a picture of our sweet cousin Jaime who was senselessly and tragically killed today at Stoneman Douglas High School. \"My heart is broken from the loss of this awesome young girl and the pain that our entire family is enduring.\" Terrified students ran out of the building, while others took refuge inside as bursts of gunfire rang out. Staff and students got on the floor in locked classrooms, with reports that the gunman shot through windows or doors. Hannah Siren, 14, who was in maths class, told the Orlando Sentinel: \"The people next door to us must have not locked their door.They all got shot.\" Student Alexa Miednik said she briefly spoke to Cruz as she and others rushed outside after the fire alarm went off and gunshots were heard. She said: \"As we were walking the whole class together, I actually was speaking to the suspect Nikolas Cruz, and as I was speaking to him he seemed very, I don’t know what the word I want to say is, but he was troubled in middle school. \"So, I kind of joked to him about it and said I’m surprised you weren’t the one who did it, and he just gave me a 'huh?'\" As the lockdown was lifted after the rampage, bewildered students and staff streamed out of the school with their hands in the air, passing heavily-armed and helmeted police officers wearing combat gear. Twelve of the dead were killed inside the school, while two others were shot just outside. One more was gunned down on the street, and two other victims died in hospital. The school, which has about 3,200 students, remained on lockdown for about 90 minutes before students were finally released and reunited with their distraught parents - who were anxiously waiting for updates - in emotional scenes. Cruz - described by former classmates as a \"troubled\" loner who was obsessed with guns - was arrested just after 4pm by police in nearby Coral Springs. He was wearing wine-colored Reserve Officers' Training Corps polo shirt, black pants and black boots. Police said Cruz, who worked at a local discount store and was attending a new school, was armed with an AR-15 rifle and had multiple magazines of ammunition when he was arrested without a struggle. Brent Black, a former classmate, told ABC News that Cruz had previously threatened to go on a shooting spree at the school. He said: \"About a year ago I saw him upset in the morning. And I was like, 'yo what’s wrong with you?' \"And he was like 'umm, don’t know.' And I was like 'what’s up with you?' \"He's like, 'I swear to God I'll shoot up this school'. And then I was like, 'watch what you’re saying around me', and then I just left him after that. He came up to me later on the day and apologised for what he said.\" Students told reporters that Cruz was familiar with the school's layout and had been involved in fire drills in the past, so he knew what to expect when the alarm went off. Attorney Jim Lewis told the South Florida Sun Sentinel that the AR-15 used in the mass shooting was legally bought by Cruz, who lived with a family friend following his mum Lynda 's death. A source told CNN that Cruz had purchased the gun in the past year after passing a background check. Cruz's adoptive mum died in November at age 68 from pneumonia, while his dad Roger died from a heart attack when he was a younger boy, it was reported. The couple had reportedly adopted Cruz on the day he was born, along with his biological brother, Zachary. Speaking on behalf of the family friend, Lewis said: “It was his gun. The family made him keep it in a locked gun cabinet in the house but he had a key.”", "Lewis said the family let Cruz move in around Thanksgiving, gave him a room and urged him to attend adult education classes. The lawyer said Cruz was \"depressed\" following his mum's death, and the family who took him in \"didn’t see this coming\". A relative told US media that Cruz had been diagnosed with autism. Following his arrest, Cruz was questioned for hours by detectives before he was charged with 17 counts of premeditated murder. Officers searched a number of properties linked to the suspect, including the home where he was living with a family friend. The FBI and Department of Homeland Security were assisting with the investigation. Former classmates claim he had previously threatened to shoot up the school, he had talked about shooting animals and he was obsessed with guns. They also said he had a bad school record and was expelled from Douglas High School after getting into a fight with his ex-girlfriend's new boyfriend. Broward County School District Superintendent Robert Runcie told reporters he did not know of any threats posed by Cruz to the school. But maths teacher Jim Gard told the Miami Herald that he believes the school had sent out an email warning teachers that Cruz should not be allowed on campus with a backpack. He added: \"There were problems with him last year threatening students, and I guess he was asked to leave campus.\" Photos posted on Cruz's Instagram account showed him posing with guns and knives. Police have described the social media posts as “very, very disturbing\". It also emerged that a YouTube user called 'Nikolas Cruz' had written chilling comments on videos just months ago. One comment under a documentary about the 1966 Texas University massacre read \"I am going to what he did\" [sic]. Another YouTube user claims someone with the handle 'Nikolas Cruz' commented on one of his videos last year, writing: \"I want to be a professional school shooter.\" The FBI were alerted to that post in September and carried out an investigation, but it was unclear what, if anything, happened from there. When Cruz was a freshman he was part of the US military-sponsored Junior Reserve Officers' Training Corp programme at the school. In an interview with Reuters, Jillian Davis, 19, a recent graduate who was in the programme with Cruz, recalled his \"strange talking sometimes about knives and guns\", but said \"no one ever took him seriously\". Chad Williams, 18, described Cruz as \"kind of an outcast\" who was \"crazy about guns\" and was known for unruly behavior at school, including a penchant for pulling false fire alarms. Trevor Hart, who had been in a Spanish class with Cruz, told the Orlando Sentinel that the 19-year-old seemed \"a little off\" and had talked about shooting lizards, squirrels and frogs. Former schoolmate Alex Azar told CBS Miami: \"He always seemed like the unstable type, the type who would do this sort of thing. He was always in the office. He was always in trouble, very unstable. He had that look to him, kind of sinister.\" Former neighbour Shelby Speno told how police were called to Cruz's home numerous times and he had been seen shooting at a fellow neighbour's chickens. Another former neighbour, Janine Kartiganer, added: “He wore a hoodie and always had his head down. He looked depressed.”", "Wednesday's shooting ranked as the ninth-deadliest mass shooting in modern US history and the second-deadliest act of gun violence ever on a US public school campus, behind the massacre at Sandy Hook Elementary School, in Newtown, Connecticut, in December 2012. In that incident, deranged gunman Adam Lanza, 20, killed 20 children aged six and seven and six adult staff members after killing his mum Nancy at their home in the town. Lanza shot and killed himself as emergency services arrived at the scene. The number of school shootings in the US has steadily increased in recent years, and the Parkland shooting is just the latest chapter in the longtime debate over preventative measures, including gun control. There were fresh calls for the US government to do more to prevent similar tragedies. US President Donald Trump didn't mention any potential preventative measures in his response to the attack. He appeared to suggest that those who were aware of the warning signs didn't do enough to alert authorities beforehand. He wrote on Twitter: \"So many signs that the Florida shooter was mentally disturbed, even expelled from school for bad and erratic behavior. Neighbors and classmates knew he was a big problem. Must always report such instances to authorities, again and again!\" In earlier tweets, he wrote: \"My prayers and condolences to the families of the victims of the terrible Florida shooting. No child, teacher or anyone else should ever feel unsafe in an American school. \"Just spoke to Governor Rick Scott. We are working closely with law enforcement on the terrible Florida school shooting.\" Reports from the US indicated that local police had dealt with Cruz on several occasions, he had been kicked out of school and staff were warned about him, and the FBI had investigated the \"professional school shooter\" comment that appeared to be posted by him on YouTube. As well, CNN reported that Cruz was able to purchase an assault rifle after passing a background check. Joe Melita, former head of the Professional Standards & Special Investigative Unit at Broward County Public Schools, told Action News Jax that that several district security officials were aware of Cruz", "He added: “They were familiar with who the young man was.”", "Former Vice President Joe Biden tweeted: \"I am at a loss for what more to say. I grieve with the families in Parkland today. I grieve with the families across the country who have suffered loss due to gun violence. Congress has a moral obligation to take action and spare more families from this violence.\" Meanwhile there have been 18 school shootings in the US already this year, an average of one every 2.5 days. At this time last year there had been seven, US media reported. According to Gun Violence Archive, there have been 30 mass shootings since January 1, or one every 1.5 days. Wednesday's school shooting occurred about 20 months after mass killer Omar Mateen, 29, murdered 49 people at a gay nightclub, called Pulse, in Orlando Florida. His rampage ended when he was shot dead by police. The June 2016 massacre was the deadliest mass shooting in modern US history until gunman Stephen Paddock, 64, killed 58 people at a country music festival in Las Vegas last October. Paddock shot and killed himself before police stormed the Mandalay Bay hotel room he had used into a sniper's perch. Get email updates with the day's biggest stories", ["www.mirror.co.uk/news/us-news/there-blood-everywhere-terrified-students-12029466", "Inside the Snapchat bloodbath: 60 minutes of terror which left 17 dead, bodies in classrooms and kids 'full of blood'"]], ["Police in Vernal Heights, Florida, arrested 3-practicing cannibals who claim eating human flesh cures both type-1 and type-2 diabetes and depression. According to Vernal Heights Chief of Police, Gregory Moore, the 3-men were arrested when officers responded to what they assumed would be a routine noise complaint. Police arrived at 3845 Toolson Lane (the home of William Provost) at approximately 7:45 PM on Sunday evening in response to a neighbor complaining of strange sounds coming from the home. Responding officers told reporters that they assumed their visit to the house would be a quick one and that they would simply be asking the residents to keep the noise down. When the officers arrived at 3845 Toolson Lane, they repeatedly knocked on the door and rang the doorbell, however, nothing could be heard over the sound a stereo inside the house repeatedly playing the same song, which was later identified as – Enya’s ‘Who Can Say’. Crime Scene Photo of residence at 3845 Toolson Lane courtesy of Vernal Heights Police Department. After attempting to get the attention of the homeowner via knocking and ringing the doorbell for approximately 5-minutes, police entered the home through an unlocked door located at the rear of the house. The responding officers told reporters that the house had been extremely dark, cluttered, and an overwhelming smell (which was later identified as decomposing flesh) filled the home. Upon clearing the first-floor of the home, the responding officers realized that the blaring music was coming from the home’s basement. According to the officers, a bizarre crime scene was quickly uncovered upon entering the basement. Three men, which have since been identified as 62-year-old William Provost, 51-year-old Dennis Ratcliff, and 36-year-old Michael Dore were sitting in a circle on the basement’s concrete floor and ritualistically chanting while eating what police initially believed was an animal carcass, but was later identified as human remains. William Provost, who police believe to be the group’s ringleader, admitted to practicing cannibalism and told arresting officers:", "Upon searching the home’s basement, police made several startling discoveries including a large room that appears to contain nothing more than decades worth of clutter, but upon further inspection, police discovered human remains hidden throughout the old wooden furniture and broken appliances. Police also discovered a kitchen style refrigerator located in a small room in the corner of the basement that contained the limbs, organs, and miscellaneous remains of what police believe to be upwards of 7-8 different individuals. In addition to the refrigerator, the small room in the basement also housed a make-shift ‘tool wall’ that contained a myriad of tools that police believe were used to dismember several victims.", "Upon their initial investigation, police believe the 3-men have been practicing cannibalism for the past 3-4 years and largely remained under the radar due to their practice of targeting and befriending homeless drifters they met at small dive-bars located upwards of 100-miles from their Vernal Heights residence. Vernal Heights Chief of Police, Gregory Moore, spoke to reporters during a brief press-conference this morning. Provost’s accomplices, 51-year-old Dennis Ratcliff, and 36-year-old Michael Dore, also admitted to cannibalizing human flesh because they believed it would cure depression and told arresting officer’s that Provost took them under his wing in late-2012. As of Tuesday afternoon, police and detectives are still conducting a search at the residence located at 3845 Toolson Lane. All three men are currently being held without bail at the Vernal Heights Municipal Jail.", ["dailybuzzlive.com/cannibals-arrested-florida/", "Cannibals Arrested in Florida Claim Eating Human Flesh Cures Diabetes and Depression"]], ["The Burning Platform", "The state of Michigan is quickly turning into a Sharia swamp, thanks to the reckless immigration policies of Obama over the past 8 years. Not only areportions of Michigan being transformed into a “mini Baghdad,” but the state is also being overrun with rampant illegal activity,where the Muslim populace is constantly being busted in welfare fraud and disgusting mutilation practices on little girls. Now thanks to the hordes of Muslims taking over the state,Michigan can add another “accomplishment” on their list, as the Justice Department is dubbing what just went down in this statethe “largest scam in United States history.”", "Muslims continually prove that they have little intentions into assimilating into western civilization or adhering to our nation’s laws after arriving to America from their third world countries.Our generosity to these savages is frequentlyrepaid by insolence, as many Muslims are constantly busted at the center of welfare fraud rings, as they seek to scam the very country who has given them so much. In yet another case of blatant disregard for for our nation’s laws, a group of Muslim doctors in Detroit have just been busted as the masterminds behind a $1.3 billion dollar fraudulent scheme, leading to the arrests of 412 people overnight, inthe “largest scam” that the United States Department of Justice has everseen. The scaminvolves a scheme whereMuslim doctors will write massive quantities of prescriptions foropioids. These drugs never land in the hands of patients however, as the Muslims will them make fraudulent claims to Medicaid and pocket the money. Additionally, the drugs often wind of on the streets as part of a huge back-alley drug operation. The U.S. Justice Department is calling this prescription drug and health care fraud scheme the largest operation of its kind in American history, naming several Michigan Muslim doctors responsible for orchestrating this hugecriminal enterprise to rip off Medicare.ClickonDetroit.com has more:", "“Officials have made 412 arrests nationwide, including 56 doctors and targeting 200 clinics. The Justice Department said those arrested areresponsible for $1.3 billion in fraudulent transactions. Federal officials saida group of Michigan doctors was responsible for a major chunk of the scheme. One of the clinics hit in the sting operations is in Farmington. Federal officials said the opioid epidemic is part of it, but the medical office and a number of others were set up specifically as a criminal enterprise to rip off Medicare. Federal officers raided the Fisher Building Wednesday, and U.S. Attorney General Jeff Sessions said their work accounted for 10 percent of the scam’s value. ‘Six doctors in Michigan prescribed patients with unnecessary opioids, some of which ended up for sale on the streets,’ Sessions said. A physician group called Global Quality used to operate out of a Woodward Avenue office building.”", "The ring leader of the massive Medicare scam is MuslimMashiyat Rashid, whoprofited with an astounding $164 million from the fraud. He had had no qualms aboutrubbing the American taxpayers’ noses in what he stole from them, frequently bragging about his large piles of cash on social media. Here’s an image he posted on Facebook where he poses beside his Bentely sedan and corporate jet…all bought and paid for with the Medicare money he scammed from theAmerican taxpayer. Other nauseating pictures show Rashid standing at the NBA finals with his court-side tickets, enjoying a life of opulence he enjoyed while screwing over the American people.Rashid’s name is included in court documents as Feds prepare their case for trial, where Muslim doctorsJoseph Betro, Spilios Pappas,Abdul Haq, Tariz Omar and Mohammad Zahoor were busted working directly with Rashid in recent years to make their millions. More than 400 others across the country were charged late last week for taking part in the health care scam in connection with a raid last week at the Fisher Building in Detroit. Other Muslim defendantsinclude:", "Trump’s Justice Department isn’t messing around, as the defendants are being brought up on a plethora of federal charges, includingfive counts of health care fraud and health care fraud conspiracy.Rashid hasadditionally been charged withconspiracy to defraud the United States and money laundering, receipt of kickbacks in connection with a federal health care program, and payment of kickbacks in connection with federal health care program. In all, investigators say that Rashid’s companies’ fraudulently billed Medicare $126 million, with a total of $1.3 billion in similar scams across the country. We must continue to sound the alarm about what’s going right underneath our noses. This isn’t the first time that Muslims have ripped off Americans with fraud, and with the hordes of migrants that liberals keep fighting to bring into our country, stories like this will sadly become the new norm if the American people do not wake the hell up soon!", "Dune Coons!", "Ha!  Big surprise!  There are thousands of these scams ripping off Americans for billions every year and damn near every one of them is run by a recent immigrant, be they Chinese, Latins, Nigerians, Muslims or other mutts.  All you dumbass whites still voting for the Democrats, wake up!  This whole thing has been rigged by the Democrats in COngress (and tolerated by the worthless, gutless Republicans).  Deport every last one of them. Are these people white?", "http://www.app.com/story/news/investigations/watchdog/2017/06/28/lakewood-welfare-fraud-how-it-happened/435196001/", "“Federal criminal complaints against Shimon and Yocheved Nussbaum, of Hadassah Lane, and Mordechai and Rachel Sorotzkin, of Albert Avenue, detail how one couple – the Nussbaums – is accused of moving money between companies they controlled and the other – the Sorotzkins – simply failed to report their full income.”", "Not according to the The Forward.  I’m not going to argue with them about it. The Fed’s ‘LARGEST BUST IN U.S. HISTORY’ should have been against the Banksters for the 2008 Great Recession. I do wish to thank Obama for bringing some of these criminals to justice………oh, wait", "If we could stop all the scams against Medicare/Medicaid/Social Security/food programs/Section 8 housing etc. etc. etc., we could probably balance the budget, reduce  or maybe even pay off the national debt, give deserving SS recipients a modest raise and provide medical care for the veterans. Our casinos in Louisiana are filled with the “entitled” playing the slots.  Our streets are filled with all these cars with these super wide spinner/mag wheels.  Most of the entitled women have hairdo’s costing many hundreds of dollars.  The nail salons are also filled with the entitled.  They all have the latest in Smart-phones. I see in the news where the student debt bomb is about to explode.  Hell, what debt bomb?  I thought most minority students got TOPS grants.  (I mean, if they didn’t get TOPS how could they go to Acapulco on Spring Break.)  I’m not just talking about African Americans.  It’s all races. I gotta go get my BP meds. The only way to stop those scams I can think of is to get rid of the programs themselves. Which is unlikely to happen anytime soon. This is all so true. I have witnessed this year’s ago and it has to be far worse now. I do not care who likes to hear it or not but we can thank the DEMOCRATIC RADICAL PARTY FOR THIS. FUNNY BUT THIS TABLET SUPPLIED THE WORD RADICAL. Even this dumb tablet knows just how CORRUPT THE DEMOCRATIC RADICAL PARTY IS. LOL IT SUPPLIED IT AGAIN. Sounds like the government has the bigger scam going. Have your courts throw out any restriction on immigration, fill the country up with foreign criminals, give them the government licenses that allow them to prescribe the government funded drugs then have the government investigate and arrest them, send them to the government run judicial system where they confiscate their wealth and fine them money that goes back to the government where they will be housed in government run prisons until such time as they are paroled and now go on government assistance. Then write outraged stories about the whole thing on the Fake News so that people demand that the government do something which in turns leads to even larger expenditures of taxpayer money to fix a problem the government designed and built. Unless I missed something it just sounds like a very large money laundering operation that guarantees an unlimited income forever. Plus police state-like power. You pretty much covered what I was thinking.  The Declaration of Independence says we have the right to alter or abolish the government and it is time we abolish this #OUTOFCONTROL monster we call the US Government.  Government is the Problem not the solution. #Freedom2020 #Freedom4All", "Sorry, but I think this is actually the largest bust in US history – http://www.dailymail.co.uk/femail/article-4724152/Porn-star-O-cup-breasts-seeks-helps-boobs-leak.html. More than a mouth full – it’s wasted. Prissy Holly, love you and Liberty Belle on FB, awesome to see you on the Burning Platform!  With any luck the Drs will go away for a long time.  #Buildthewall its pretty obvious that America in in no way enhanced by third world immigration much less Muslim third world immigration!  Thank you for the research!", "Apparently, Allah has no problem with Muslem doctors and professionals stealing money from the Infidels as long as the women keep themselves covered. I dunno, is Michigan still there after all the social experimentation visited upon the beleaguered site of a once thriving auto manufacturing industry?  It could be an Urban Legend:  Michigan  — Real State or just a State of Mind. They started shipping welfare niggers up to the UP from Detroit, and the welfare bandits with Southrun accents were flooding in, so I bailed. At least where I am in Communisota it’s still white and mostly working, so I got that going for me…", "Hey, it’s easier than growing the poppies in Afghanistan…", "Curiosity:", "How do immigrant doctors get certified to practice medicine in the United States?", "Do they face all the same requirements as Americans becoming doctors do?", "As long as they have a piece of paper with an embossed candy wrapper in a corner, and a stethoscope, they’re good-to-go…", "They get to be a surgeon if they can’t speak more than 5 words in English. using their innate talents of observation, and mimicry, they have copied the culture of our former slave population, and created an economic boom that will soon be replicated in our democratic run cities. coming soon to a sanctuary city near you…. Yeah, well, it’s an epidemic:  http://www.zerohedge.com/news/2017-07-24/fbi-seized-crushed-hard-drives-home-wasserman-schultz-it-aide", "Speaking of Michigan and doctors:   http://www.barenakedislam.com/2017/07/23/michiganistan-muslim-cutter-performs-genital-mutilation-on-a-little-girl-while-she-screams-and-her-father-holds-her-legs-open/", "What is wrong with people?", "First Maggie they are not people, they are low IQ Dune Coons, that are living in an 11th century reality.   They don’t even know why they do it – mindless savagery. Must be FAKE NEWS!", "When I google searched CNN, or main stream media for this story, they only kick back I got was:", "“Kamau Bell: What I learned from Muslims in small-town America”", "And if you don’t agree with cnn or kamau, well then you are just a Islamophobic raycist Trump loving ‘merican that hates anyone that is not white bread. I wonder how much they have donated to SEN Debbie Stabacow’s reelection extravaganza?  Vote Kid Rock and audit them!  Then send them back home to a “stan” somewhere where they can really breathe free. Any immigrant convicted of a crime should be deported.  Period. KAD,", "I disagree…if my punishment for going to London ripping off their stock market for $150 million is to be sent home, well shit I was planning on buying my own ticket home but if you insist……that’s not punishment….we act like not living in the USA is oh so bad….they come here for opportunity….if they scam us and get rich, they got their opportunity….then they return home wtf?", "“…the reckless immigration policies of Obama over the past 8 years”. Hey, don’t give Barry all the credit, Bush 41 and 43 deserve a bunch it too. First for their destabilizing wars and then their “bomb ’em then invite ’em” immigration policies. Same “religion of peace” mantra. Typical though, they fuck it up, then we have to suck it up. A young Arab boy asks his father, “What is that strange hat you are wearing?”", "The father said, “Why, my son, it is a ‘chechia.’ In the desert it protects our heads from the intense heat of the sun.”", "“And what is this clothing you are wearing?” asked the boy. “This long flowing robe seems so…”", "“Oh, my son!” exclaimed the father. “It is very simple. This is a ‘djbellah.’ As I have told you, in the desert it is not only very hot, but the sand is always blowing. My djbellah protects the entire body,”", "The son then asked, “But Father, what about those ugly shoes you have on your feet?”", "“These are ‘babouches’ my son,” the father replied. “You must understand that although the desert sands are very beautiful, they are also extremely hot. These ‘babouches’ keep us from burning our feet.”", "“So tell me then,” added the boy…", "“Yes, my son…”", "“Why are you living in Dearborn, Michigan, and still wearing all this shit?", "President Obama promised to change the face of America and as he allowed illegals to flood in unchecked or half assed at best . Then he imported miscreants that hate us white Americans and want to kill us and he is fine with that too ! So Muslims colluding to rip off America . OK let’s all act surprised at a plan to bankrupt us make us sick and weak , then KILL US", "His punishment will be a decade long discussion of what to do about him, then finally deported to the country of origin where he immediately takes off to a beach resort……thx Obama!", "To donate via Stripe, click here. To donate via credit card, click here. …or on a mobile device, scan this QR code:", "To Donate Monthly via Stripe, click here. To Contact Hardscrabble Farmer before supplies run out:", "[emailprotected]", "Or call anytime at 603-748-6917", "Wall Art to Perfectly Compliment Your", "Man-Cave, Home Office or Cabin", "Interior or Exterior - All Year Round", "23x40 - 26x48 - 33x60 - Custom", "$349 - $449 - $649 - $949 + S&H", "Custom Union Designs on Request", "100% Satisfaction Guaranteed", "HandCraftedbyJohn.com", "Enter your email address to subscribe to The Burning Platform and receive notifications of new posts by email.", "Email Address", "Subscribe", "Most ignorance is vincible ignorance. We don’t know because we don’t want to know. Subscribe now to keep reading and get access to the full archive. Continue reading", ["www.theburningplatform.com/2017/07/24/412-michigan-muslims-arrested-in-feds-largest-bust-in-u-s-history/", "412 Michigan Muslims Arrested In Fed’s ‘LARGEST BUST IN U.S. HISTORY’"]], [["gunrights.trendolizer.com/2017/10/jason-aldean-gig-canceled-after-he-sells-out-to-liberals-on-snl---breaking.html", "Jason Aldean Gig Canceled After He Sells Out To Liberals On SNL"]], ["OBSERVER ONLINE", "OBSERVER ONLINE", "The latest news and headlines!", "by", "observeronline", "·", "September 7, 2017", "A mosque in Georgia is under fire after they solicited donations allegedly for victims of Hurricane Harvey but decided to keep them and send them to a different kind of refugee instead. “Because Donald Trump will not let victims of war and crime seek solitude in the United States, we can not in good conscience help his people when so many Muslims can not find shelter,” said Imam Sharaj Alkalb of the Ramazala Mosque in Peachton. “Allah has told us that we must consider where the need is greater and respond to it.”", "The mosque recently made headlines for its “Good work” in the community. According to news reports at the time, the mosque had raised more than $340,000 in cash and supplies “for the victims of Hurricane Harvey.” All of that will now be sent overseas to Syria to “help” people in refugee camps, which have been repeatedly identified as breeding grounds for ISIS recruitment. “We intended to send it to the people impacted by the hurricane,” Alkalb said when asked if he lied about his intent when asking for donations from the community. “But after much prayer, Allah told us that we must help the people who need it most.”", "Residents are outraged, demanding that Alkalb return their donations but he says he will not be doing that. It’s time for us to stop tolerating this stuff and make our voices heard!", "August 29, 2017", "by", "observeronline", "· Published August 29, 2017", "January 24, 2017", "by", "observeronline", "· Published January 24, 2017", "· Last modified January 25, 2017", "January 6, 2018", "by", "observeronline", "· Published January 6, 2018", "That`s fraud should be arrested", "That`s fraud should be arrested and jailed", "What brain dead fools would donate to them to start with ? Are there really people that stupid in Georgia I’m from Georgia still live in Georgia and I know there’s no way in hell I would do such a thing it makes me so mad that Americans are still blind to these bottom feeders called Muslims ” he prayed to his devil and his devil told him to send it all to more bottom feeders what a crock of shit ” they had it planned the whole time knowing some stupid ass Americans would fall for it and that did ” so friggin stupid !!!", "That is “fraud.” They should be shut down and all what was given for Harvey victims should go to Harvey victims!", "These Scumbags are not in Greater need and they’re victims of War. The people who lost their homes and loved ones are victims not the Islamic Scumbags", "if this is true ,I am sure that there are enough people who supported this cause for the original people to get some sort of FBI investigation and freeze the thieving barstewards bank accounts. this is fraud on a grand scale. that’s fine. NOW THE FEDERAL GOVT CAN STEP IN , CLOSE DOWN THE WHOLE MOSQUE AND ARREST ALL INVOLVED FOR AIDING AND ABETTING TERRORIST WHO ARE ATTACKING US. Let them get out,stoping using false reasons to collect for people over seas,we already do too much", "I bet the American KKK could convince these lying thieves to send that money to the people for which it is intended. Are the people of American tired enough of being lied to, stolen from, insulted and jerked around yet?", "Do you have the address for the mosque?", "Exactly why we need a Muslim Ban in our Country. They do not want to be part of America, they want to overthrow America! They are just using any method to weaken us until they institute Sharia Law! Deport them all now!", "Arrest the leaders of the mosque for financial fraud on a grand scale, then confiscate their assets and give them to Harvey victims. Done. people don’t get it about zakat – or any moslem ‘donation’ or any useful idiot that gives money to moslems. sharia forbids them from helping any non-moslem, or giving them any money. Zakat, or moslem money, is to be distributed according to sharia and its holiest form is violent jihad – violent and stealth jihads against non-moslems. I won’t write out Quran 8:2-4", "When moslems say ‘for the poor’, or ‘for orphans’, etc – they are talking only about moslems. In regards to orphans – a non-moslem orphan will be taken and used as a slave, a sexual object, sometimes as a janissary (abused in all ways and taught to fight for their allah-thing), etc. We should NEVER give them money, a tax writeoff, or allow them to just distribute their zakat freely according to sharia because part of it does indeed fund violent jihad against us. They will double talk and then act offended if we don’t give them what they want because their sharia says we are to subjugate ourselves to them. More", "Suspect in Deadly Kansas SWATting Charged with Manslaughter", "13 Jan, 2018", "Missouri Man Faces Terrorism Charges for Attempted Train Hijacking", "6 Jan, 2018", "Michael Wolff to Trump: Thanks for Helping Me Sell Books", "6 Jan, 2018", "“Fire and Fury” Author Is Standing by His Claims of White House Staffers’ Concerns", "6 Jan, 2018", "Water Cooler 1/06/17 Open Thread; Things to be Thankful for: Pets", "6 Jan, 2018", "OBSERVER ONLINE © 2018. All Rights Reserved.", ["observeronline.news/georgia-mosque-keeps-hurricane-harvey-donations-will-send-to-syrian-refugees-instead/", "Georgia Mosque KEEPS Hurricane Harvey Donations, Will Send To Syrian Refugees Instead"]], ["This is a satirical website. Don't take it Seriously. It's a joke.    2059  427410 Shares", "The announcement was released late on Friday Sept 8th in a press conference, that the famous candy, the original Reese's peanut butter cups would no longer be available! \"By October 2017 they will all be removed from the shelves!\" Manufacturer said due to the new versions and a severe decline in sales. It is no longer justifiable to continue producing the product. Originally there were plans to keep them through Halloween, however those plans have fallen through. We say goodbye to a candy icon. RIP Reese's peanut butter cups. Make sure to get you one before they are gone!", "This is a satirical website. Don't take it Seriously. It's a joke. 1", "a monkey escapes from the miami zoo and throws bananas from a tree Mario a monkey from the Miami Zoo has escaped last Friday from his cage when he escaped, he threw bananas at people from all over Los Angeles. This has led to a video called \"banana rain going viral\" right now this little criminal monkey is found in prison.", "2", "octopus teaches math at harvard They hire octopus to teach math at harvard, the octopus is called arnold and it is said that he is paid 3000 dollars per class. here are some images", "This website is an entertainment website, stories are created by users. These are humorous stories, fantasy, fictional, that should not be seriously taken or as a source of information. FreeReadings.org - Mediumina.com -", "Plan -", "2024 -", "2023 -", "2022 -", "2021 -", "2020 -", "2019 -", "2018 -", "2017 -", "2016 -", "Plan -", "2024 -", "2023 -", "2022 -", "2021 -", "2020 -", "2019 -", "2018 -", "2017 -", "2016 -", ["www.breakingnews247.net/59bc13819a723/world-s-most-popular-candy-to-be-removed-from-shelves-by-october-2017.html", "World's most popular candy to be removed from shelves by October 2017!"]], [["www.zambianobserver.com/hiv-virus-found-in-walmart-bananas-after-10-year-old-boy-agreements-the-infection/", "“HIV VIRUS” Found In Walmart Bananas After 10 Year Old Boy Agreements The Infection"]], [["forums.spacebattles.com/threads/%E2%80%9Cgay-people-should-wear-specially-colored-clothes-to-warn-straight-people%E2%80%9D.362660/", "“Gay People Should Wear Specially-Colored Clothes To Warn Straight People”"]], ["Offshore Casinos", "Slots.lv Review", "Slots Plus Casino Review", "Sun Palace Casino Review", "Vegas Casino Online Review", "Wild Casino Review", "Chumba Casino Review", "LuckyLand Slots Review", "BigSpin Casino Review", "Las Vegas USA Casino Review", "Cloudbet Review", "BUSR Review", "Bovada Review", "Bookmaker.eu Review", "BetUS Review", "BetOnline Review", "BetAnySports Review", "BetNow Review", "5Dimes Review", "Best Offshore Sportsbooks", "Best Wyoming Sportsbooks", "Best West Virginia Sportsbooks", "Best Washington Sportsbooks", "Best Washington DC Sportsbooks", "Best Virginia Sportsbooks", "Best Vermont Sportsbooks", "Best Utah Sportsbooks", "Best Texas Sportsbooks", "Best Tennessee Sportsbooks", "Best South Dakota Sportsbooks", ["yournewswire.com/smallville-star-sold-children-rothschilds-clintons/", "‘Smallville’ Star Confesses She Sold Children To Rothschilds And Clintons"]], ["Lance Armstrong let his Twitter followers -- still 3.8 million strong -- know he was back in Austin this weekend and had someone take a picture to show how he was spending a lazy Saturday afternoon. \"Back in Austin and just layin' around,\" he wrote in the tweet. He attached a picture of himself laying on a couch in a room that just happened to have seven yellow Tour de France jerseys on the wall. Purely random, I'm sure. It's not a #humblebrag as much as it's a #shoveitinyourfacebrag. It's cocky, it's condescending and it's not going to help Armstrong's battered public image. Contrition, not defiance, is the way to go. Armstrong was banned for life last month by the International Cycling Union and stripped of those seven Tour wins. (The jerseys, apparently, can stay.)", "Look, I'm on Lance Armstrong's side, as much as one can be on the side of a suspected/known cheater. His cycling wins may have been a sham (just like victories by most athletes in the sport) but his work for cancer research, awareness and patients has been inspirational. Would it have been better if Armstrong stayed clean, became a middling cyclist and Livestrong never existed? I don't see how any logical person could make that argument. Shades of gray cloud the picture, of course, but I still think his net contribution to our world is greater than his flaws. Regardless, Armstrong stepped down Monday from the Livestrong board. He founded the charity in 1997. If pictures like this are any indication, Armstrong has moved past denial into the anger phase of his coping. Next he'll be trying to buy Tour titles off Miguel Indurain, followed by his growing a beard phase and then he'll accept his actions, sit down for an interview with Oprah and get back into the good graces of the American public. It doesn't feel like it now, but it'll happen one day.", ["www.usatoday.com/story/gameon/2012/11/12/lance-armstrong-yellow-jerseys-picture/1699693/", "Lance Armstrong's defiant Twitter photo shows him relaxing with seven yellow jerseys"]], ["http://buzzfeedusa.com/crew-air-force-one-refuses-fly-obama-6000-miles-just-play-golf/", "Δ", "Enter your email address to subscribe to this blog and receive notifications of new posts by email.", "Email Address:", "Sign me up!", "MY OPINIONS AND MUSINGS", "We are an extension of our Higher-selves, who  are our Guardians", "What's happening on our planet---and why", "There is nothing to see here; move along. Exposing The Establishment Daily", "Commentary. Reflection. Judgment. A great WordPress.com site", "ALL THAT MATTERS........ PERSPECTIVE FROM AN AGING SENIOR CITIZEN", "The Voice of Americas Forgotten Heroes, Our Veterans", "Politics & News for Patriots, Conservatives, Libertarian Republicans and Ron Paul Lovers", "This WordPress.com site is the bee's knees", "Smile! You’re at the best WordPress.com site ever", "True Power Plant Stories", "THE DRIVELLINGS OF TWATTERSLEY FROMAGE", "Bringing Truth, Justice and the American Way", "INTERNATIONAL GLOBAL PARTNERSHIPS - \"Reform begins from the grounds up.\" Born-Again Sephardic W/ A Jewish Husband. CONTACT: ashedinatmj@gmail.com. I do NOT give out my phone number anymore. Gastonian Viewpoints in an Oligarchy Malaise", ["asnowrose.wordpress.com/2016/12/20/breaking-crew-of-air-force-one-refuses-to-fly-obama-6000-miles-just-to-play-golf-buzzfeedusa/", "Breaking: Crew Of Air Force One Refuses To Fly Obama 6000 Miles ‘Just To Play Golf’ – BuzzfeedUSA"]], ["Utilizing natural light for a baby photoshoot can result in soft, flattering images that beautifully capture the innocence and beauty of your little one. Natural light offers a gentle and flattering illumination that enhances your baby’s features and creates a warm and inviting atmosphere. Choose the right time of day: The quality of natural light […]", "Choosing the right WiFi distributor is crucial for ensuring reliable connectivity, smooth integration, and excellent support. With numerous options available, selecting the best WiFi distributor requires careful consideration of various factors. Product portfolio: Look for a WiFi distributor that offers a broad range of products from leading manufacturers. This includes access points, routers, switches, antennas, […]", "Balancing the demands of work, personal life, and ACCA studies can be challenging, but with effective strategies and time management techniques, it’s possible to achieve harmony and success in all areas. Find here some strategies to help you balance work, life, and ACCA in Abu Dhabi studies effectively: Define your short-term and long-term goals: Define […]", "Incorporating high-protein meals into your meal prep routine can be an effective strategy for supporting weight loss goals. Protein helps increase feelings of fullness, boosts metabolism, and preserves lean muscle mass, all of which are beneficial for shedding pounds. Choose lean protein sources: Opt for lean protein sources in your weight loss meal plan such […]", "Imagine setting sail on a luxurious yacht, surrounded by crystal blue waters and breathtaking views as the sun sets on the horizon. As you make your way to the top deck, you hear the pulsating rhythm of a world-renowned DJ, who is spinning tracks that get everyone moving and shaking. The atmosphere is electric, filled […]", "Yachts are luxurious vessels that offer a unique vacation experience. However, just like any other watercraft, they come with their own set of risks and dangers. That’s why it is crucial to have the right equipment and procedures in place for yacht safety. Visit this site to choose the best yacht rental Dubai. Life jackets […]", "Interior fit out services play a crucial role in the transformation of interior spaces, turning empty shells into fully functional and aesthetically pleasing environments. From residential homes to commercial offices, retail stores, and hospitality venues, interior fit out services encompass a wide range of activities aimed at optimizing the use of space while enhancing its […]", "Kitchen organization may seem like an overwhelming task, but with the right tips and tricks, you can bring order to chaos in your kitchen. From decluttering to utilizing space efficiently, these tips will help you transform your kitchen design in Dubai into a well-organized and functional space. Strategic utensil placement: Begin by organizing utensils in […]", "As the design world continues to evolve, so does the landscaping field. New trends and innovations emerge each year, offering exciting possibilities for transforming outdoor spaces. Whether planning a complete overhaul or simply looking to refresh your existing landscape, exploring the latest landscaping trends can inspire you to create a stunning and contemporary outdoor design. […]", "Epoxy resin is a fascinating material widely used in various industries, including construction, manufacturing, and art. The chemical reaction between the resin and the hardener is at the core of epoxy’s unique properties. In this article, we will delve into the science behind epoxy and explore the crucial role of the hardener in its curing […]", ["daily-vine.com/cnn-pulls-plug/", "WHOA! YouTube Witness Makes SHOCKING Admission On LIVE TV! CNN PULLS PLUG IMMEDIATELY! — ShareRED"]], [["www.abcnews-us.com/2018/04/11/florida-passes-bill-legalizing-recreational-use-of-marijuana/", "Florida passes bill legalizing recreational use of marijuana"]], ["DECATUR, Alabama –", "Police were recently tipped off to a reported meth lab that was being run by Walmart employees in what they are calling one of the biggest busts in decades. Police Chief Robert Garner said that an anonymous tip was left on their drug hotline, expressing concern about a horrible burning smell that was coming from the back of the Decatur WalMart facility. When an officer was sent to investigate, the store was instantly shut down as he discovered a meth lab that took up the entire back room. “The thing was massive, and contained enough materials to make hundreds, if not thousands, of pounds of crystal meth,” said Chief Garner. “Apparently, every employee in the store was a part of it, from working with and gathering materials, to cooking, to selling it outside of the store. It was a full, massive operation.”", "No one from Walmart’s corporate office was available for comment, but an unofficial spokesperson did say that they were “disappointed” that they weren’t able to use their company discount to get meth before the place was shut down.  comments", "Copyright © 2024 Empire News LLC", "Design & Developed By  Open Source Technologies.", ["empirenews.net/police-discover-meth-lab-in-back-room-of-alabama-walmart/", "Police Discover Meth Lab In Back Room of Alabama Walmart"]], ["By clicking “Create Account”, you are indicating that you have", "read and agree to the Terms of Service.", "Add an image, video, or tweet by pasting in the URL:", "Add a link like this:", "Simple formatting:", "How to write for Genius", ["genius.com/discussions/219349-Donald-trump-protester-speaks-out-i-was-paid-s3500-to-protest-trumps-rally", "Donald Trump Protester Speaks Out: “I Was Paid $3,500 To Protest Trump’s Rally”"]], ["Maharashtra state has taken a significant step towards boosting the enrolment of girls in higher... 1. Introduction Today, on February 12, 2024, students across the nation are holding their breath... Embarking on a career journey after completing your 12th-grade education is a critical phase that... We keep you updated with the latest feed!", "@ 2024 All Copyright Reserved", ["dailyfeed.news/russian-mansions-obama-seized-were-meant-to-be-illegal-gifts-to-sasha-and-malia/", "BUSTED: Russian Mansions Obama Seized Were Meant To Be Illegal Gifts To Sasha And Malia"]], ["This is a forum for free thinking and for discussing issues which have captured your imagination. Please respect other views and opinions, and keep an open mind. Our goal is to create a fairer and more transparent world for a better future.", ["www.reddit.com/r/conspiracy/comments/7ww8j1/russian_source_behind_trump_dossier_killed_in/", "Russian source behind Trump dossier killed in Russian plane crash, Rosatom CFO also dead. : conspiracy"]]]
